STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
/* Application context*/
GMAPAPP_Context_t GMAPAPP_Context = {0};

/*Audio profiles configuration*/
CAP_Config_t APP_CAP_Config = {0};
BAP_Config_t APP_BAP_Config = {0};
CCP_Config_t APP_CCP_Config = {0};
MCP_Config_t APP_MCP_Config = {0};
VCP_Config_t APP_VCP_Config = {0};
MICP_Config_t APP_MICP_Config = {0};
CSIP_Config_t APP_CSIP_Config = {0};

/*Buffers allocation used in Generic Audio Framework library for internal use*/
static uint32_t aCAPMemBuffer[DIVC(CAP_DYN_ALLOC_SIZE,4)];
static uint32_t aPACSSrvMemBuffer[DIVC(BAP_PACS_SRV_DYN_ALLOC_SIZE,4)];
#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
static uint32_t aBASSSrvMemBuffer[DIVC(BAP_BASS_SRV_DYN_ALLOC_SIZE,4)];
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
static uint32_t aASCSSrvMemBuffer[DIVC(BAP_ASCS_SRV_DYN_ALLOC_SIZE,4)];
static uint32_t aISOChnlMemBuffer[DIVC(BAP_ISO_CHNL_DYN_ALLOC_SIZE,4)];
static uint32_t aNvmMgmtMemBuffer[DIVC(BAP_NVM_MGMT_DYN_ALLOC_SIZE,4)];
static uint32_t audio_init_buffer[BLE_AUDIO_DYN_ALLOC_SIZE];
static BleAudioInit_t pBleAudioInit;
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
static uint32_t aRenderMemBuffer[DIVC(BLE_VCP_RDR_DYN_ALLOC_SIZE,4)];
#endif /*(APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1)
static uint32_t aMicDevMemBuffer[DIVC(BLE_MICP_DEV_DYN_ALLOC_SIZE,4)];
#endif /*(APP_MICP_ROLE_DEVICE_SUPPORT == 1u)*/
#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)
static uint32_t aSetMemberMemBuffer[DIVC(BLE_CSIP_SET_MEMBER_DYN_ALLOC_SIZE,4)];
#endif /*(APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)*/

/* Buffers allocation for LC3*/
static uint32_t aLC3SessionMemBuffer[DIVC(CODEC_LC3_SESSION_DYN_ALLOC_SIZE,4)];
static uint32_t aLC3ChannelMemBuffer[DIVC(CODEC_LC3_CHANNEL_DYN_ALLOC_SIZE,4)];
static uint32_t aLC3StackMemBuffer[DIVC(CODEC_LC3_STACK_DYN_ALLOC_SIZE,4)];

static uint8_t aCodecPacketsMemory[MAX_CHANNEL][CODEC_POOL_SUB_SIZE];

/* In and Out audio buffers sized for an LC3 frame (double buffer, 16 bits per sample) */
#if (SAI_SRC_MAX_BUFF_SIZE != 0)
static uint16_t aSrcBuff[SAI_SRC_MAX_BUFF_SIZE] __attribute__((aligned));
#else
static uint16_t *aSrcBuff = NULL;
#endif /*(SAI_SRC_MAX_BUFF_SIZE != 0)*/
#if (SAI_SNK_MAX_BUFF_SIZE != 0)
static uint16_t aSnkBuff[SAI_SNK_MAX_BUFF_SIZE] __attribute__((aligned));
#else
static uint16_t *aSnkBuff = NULL;
#endif /*(SAI_SNK_MAX_BUFF_SIZE != 0)*/

static uint16_t* pPrevData = NULL;
static uint8_t Nb_Active_Ch = 0;

#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
#if (APP_VCP_RDR_NUM_AIC_INSTANCES > 0)
static VCP_AIC_InitInst_t aAICInst[APP_VCP_RDR_NUM_AIC_INSTANCES];
#endif /*(APP_VCP_RDR_NUM_AIC_INSTANCES > 0)*/
#if (APP_VCP_RDR_NUM_VOC_INSTANCES > 0)
static VCP_VOC_InitInst_t aVOCInst[APP_VCP_RDR_NUM_VOC_INSTANCES];
#endif /*(APP_VCP_RDR_NUM_VOC_INSTANCES > 0)*/
uint8_t Volume = 0x80;
uint8_t Mute = 0x00;
#endif /*(APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/

#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1)
#if (APP_MICP_DEV_NUM_AIC_INSTANCES > 0u)
static MICP_AIC_InitInst_t aMicAICInst[APP_MICP_DEV_NUM_AIC_INSTANCES];
#endif /* (APP_MICP_DEV_NUM_AIC_INSTANCES > 0u) */
uint8_t MicMute = 0x00;
#endif /*(APP_MICP_ROLE_DEVICE_SUPPORT == 1u)*/

#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
#if (BAP_BROADCAST_ENCRYPTION == 1)
uint32_t aAPP_BroadcastCode[4u] = {0x00000001, 0x00000002, 0x00000003, 0x00000004};
#else /*(BAP_BROADCAST_ENCRYPTION == 1)*/
uint32_t aAPP_BroadcastCode[4u] = {0x00000000, 0x00000000, 0x00000000, 0x00000000};
#endif /*(BAP_BROADCAST_ENCRYPTION == 1)*/
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/

typedef struct
{
  Sampling_Freq_t Frequency;
  uint8_t         Multiplier1;
  uint8_t         Multiplier2;
} CombinedFreqParameters;

const CombinedFreqParameters APP_CombinedFrequencyTable[9][9] =
             /*                         8KHz                         16KHz                                    24 KHz                          32 KHz                                   48KHz       */
             {{{0, 0, 0}, {0, 0, 0},                    {0, 0, 0}, {0, 0, 0},                    {0, 0, 0}, {0, 0, 0},                    {0, 0, 0},                    {0, 0, 0}, {0, 0, 0}}, \
/* 8KHz */    {{0, 0, 0}, {SAMPLE_FREQ_8000_HZ, 1, 1},  {0, 0, 0}, {SAMPLE_FREQ_16000_HZ, 2, 1}, {0, 0, 0}, {SAMPLE_FREQ_24000_HZ, 3, 1}, {SAMPLE_FREQ_32000_HZ, 4, 1}, {0, 0, 0}, {SAMPLE_FREQ_48000_HZ, 6, 1}}, \
              {{0, 0, 0}, {0, 0, 0},                    {0, 0, 0}, {0, 0, 0},                    {0, 0, 0}, {0, 0, 0},                    {0, 0, 0},                    {0, 0, 0}, {0, 0, 0}}, \
/* 16KHz */   {{0, 0, 0}, {SAMPLE_FREQ_16000_HZ, 1, 2}, {0, 0, 0}, {SAMPLE_FREQ_16000_HZ, 1, 1}, {0, 0, 0}, {SAMPLE_FREQ_48000_HZ, 3, 2}, {SAMPLE_FREQ_32000_HZ, 2, 1}, {0, 0, 0}, {SAMPLE_FREQ_48000_HZ, 3, 1}}, \
              {{0, 0, 0}, {0, 0, 0},                    {0, 0, 0}, {0, 0, 0},                    {0, 0, 0}, {0, 0, 0},                    {0, 0, 0},                    {0, 0, 0}, {0, 0, 0}}, \
/* 24KHz */   {{0, 0, 0}, {SAMPLE_FREQ_24000_HZ, 1, 3}, {0, 0, 0}, {SAMPLE_FREQ_48000_HZ, 2, 3}, {0, 0, 0}, {SAMPLE_FREQ_24000_HZ, 1, 1}, {SAMPLE_FREQ_96000_HZ, 4, 3}, {0, 0, 0}, {SAMPLE_FREQ_48000_HZ, 2, 1}}, \
/* 32KHz */   {{0, 0, 0}, {SAMPLE_FREQ_32000_HZ, 1, 4}, {0, 0, 0}, {SAMPLE_FREQ_32000_HZ, 1, 2}, {0, 0, 0}, {SAMPLE_FREQ_96000_HZ, 3, 4}, {SAMPLE_FREQ_32000_HZ, 1, 1}, {0, 0, 0}, {SAMPLE_FREQ_96000_HZ, 3, 2}}, \
/* 44.1KHz */ {{0, 0, 0}, {0, 0, 0},                    {0, 0, 0}, {0, 0, 0},                    {0, 0, 0}, {0, 0, 0},                    {0, 0, 0},                    {0, 0, 0}, {0, 0, 0}}, \
/* 48KHz */   {{0, 0, 0}, {SAMPLE_FREQ_48000_HZ, 1, 6}, {0, 0, 0}, {SAMPLE_FREQ_48000_HZ, 1, 3}, {0, 0, 0}, {SAMPLE_FREQ_48000_HZ, 1, 2}, {SAMPLE_FREQ_96000_HZ, 2, 3}, {0, 0, 0}, {SAMPLE_FREQ_48000_HZ, 1, 1}}, \
              };

/* Private functions prototypes-----------------------------------------------*/
static tBleStatus CAPAPP_Init(Audio_Role_t AudioRole, uint8_t csip_config_id);
static tBleStatus GMAPAPP_GMAPInit(GMAP_Role_t Role);
static void GMAPAPP_CAPNotification(CAP_Notification_Evt_t *pNotification);
static APP_ACL_Conn_t *APP_GetACLConn(uint16_t ConnHandle);
static APP_ACL_Conn_t *APP_AllocateConn(uint16_t ConnHandle);
static APP_ASE_Info_t *APP_GetASE(uint8_t ASE_ID,uint16_t ACL_ConnHandle);
static uint8_t APP_UnicastSetupAudioDataPath(uint16_t ACL_ConnHandle,
                                             uint16_t CIS_ConnHandle,
                                             uint8_t ASE_ID,
                                             uint32_t ControllerDelay);
#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
static uint8_t APP_BroadcastSetupAudio(Audio_Role_t role);
static uint8_t APP_StartBroadcastAudio(Audio_Role_t role);
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
static int32_t start_audio_source(void);
static int32_t start_audio_sink(void);
static uint8_t APP_GetBitsAudioChnlAllocations(Audio_Chnl_Allocation_t ChnlLocations);
static void APP_ParseMetadataParams(APP_ASE_Info_t *pASE,
                                    uint16_t ConnHandle,
                                    uint8_t const *pMetadata,
                                    uint8_t MetadataLength);
static uint8_t GMAPAPP_BuildAdvDataPacket(uint8_t *pAdvData,
                                         uint8_t *AdvPacketLen,
                                         CAP_Announcement_t AnnouncementType,
                                         uint8_t EnableSolicitationRequest,
                                         uint16_t Appearance);
static uint16_t APP_UnavailableAudioContexts(ASE_Type_t Type,
                                             Audio_Context_t AvailableAudioContext,
                                             Audio_Context_t AudioContexts);
static uint16_t APP_ReleasedASEStreamingAudioContexts(APP_ACL_Conn_t *pConn,APP_ASE_Info_t *pASE, uint16_t AudioContexts);

#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
static void VCP_MetaEvt_Notification(VCP_Notification_Evt_t *pNotification);
#endif /*(APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/

#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1)
static void MICP_MetaEvt_Notification(MICP_Notification_Evt_t *pNotification);
#endif /*(APP_MICP_ROLE_DEVICE_SUPPORT == 1u)*/

