STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
static char Hex_To_Char(uint8_t Hex);
static void Print_String(uint8_t *pString, uint8_t StringLen);
/* Exported functions --------------------------------------------------------*/

extern void APP_NotifyToRun(void);

/* Functions Definition ------------------------------------------------------*/

void GMAPAPP_Init(uint8_t csip_config_id)
{
  tBleStatus status;

#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 0u)
  if ( csip_config_id > 0u)
  {
    return HCI_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE_ERR_CODE;
  }
#endif /* (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 0u) */

  /* Set correct appearance in GAP Database */
  if (csip_config_id == 0)
  {
    status = SetGapAppearance(GAP_APPEARANCE_HEADPHONES);
  }
  else
  {
    status = SetGapAppearance(GAP_APPEARANCE_EARBUD);
  }

  /* Init CAP Acceptor with Unicast Server */
  status = CAPAPP_Init(APP_AUDIO_ROLE,csip_config_id);
  LOG_INFO_APP("CAPAPP_Init() returns status 0x%02X\n", status);
  if (status == BLE_STATUS_SUCCESS)
  {
    /* Initialize the TMAP layer*/
    status = GMAPAPP_GMAPInit(APP_GMAP_ROLE);
    LOG_INFO_APP("GMAPAPP_GMAPInit() with role 0x%02X returns status 0x%02X\n", APP_GMAP_ROLE, status);
    UNUSED(status);
  }
}


tBleStatus GMAPAPP_Linkup(uint16_t ConnHandle)
{
  tBleStatus status = HCI_COMMAND_DISALLOWED_ERR_CODE;
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(ConnHandle);
  if (p_conn != 0)
  {
    /* GMAP linkup*/
    status = GMAP_Linkup(ConnHandle);
    LOG_INFO_APP("GMAP Linkup on ConnHandle 0x%04X returns status 0x%02X\n",
                ConnHandle,
                status);
  }
  return status;
}

/**
  * @brief  Notify CAP Events
  * @param  pNotification: pointer on notification information
 */
void CAP_Notification(CAP_Notification_Evt_t *pNotification)
{
  /* Notify App */
  GMAPAPP_CAPNotification(pNotification);
}


/**
  * @brief  Notify GMAP Events
  * @param  pNotification: pointer on notification information
 */
void GMAP_Notification(GMAP_Notification_Evt_t *pNotification)
{
  switch(pNotification->EvtOpcode)
  {
    case GMAP_LINKUP_COMPLETE_EVT:
    {
      tBleStatus ret;
      APP_ACL_Conn_t *p_conn;
      GMAP_AttServiceInfo_Evt_t *p_gmap_info = (GMAP_AttServiceInfo_Evt_t *) pNotification->pInfo;
      LOG_INFO_APP("GMAP Linkup Complete Event with ConnHandle 0x%04X is received with status 0x%02X\n",
                  pNotification->ConnHandle,
                  pNotification->Status);
      if (pNotification->Status == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("GMAP Role = 0x%02X\n", p_gmap_info->GMAPRole);
        LOG_INFO_APP("UGG Features = 0x%02X\n", p_gmap_info->UGGFeatures);
        LOG_INFO_APP("UGT Features = 0x%02X\n", p_gmap_info->UGTFeatures);
        LOG_INFO_APP("BGS Features = 0x%02X\n", p_gmap_info->BGSFeatures);
        LOG_INFO_APP("BGR Features = 0x%02X\n", p_gmap_info->BGRFeatures);
      }
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        if (p_conn->ConfirmIndicationRequired == 1u)
        {
          /* Confirm indication now that the GATT is available */
          ret = aci_gatt_confirm_indication(pNotification->ConnHandle);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : aci_gatt_confirm_indication command, result: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("  Success: aci_gatt_confirm_indication command\n");
          }
          p_conn->ConfirmIndicationRequired = 0u;
        }

        if (pNotification->Status == BLE_STATUS_SUCCESS)
        {
          p_conn->AudioProfile |= AUDIO_PROFILE_GMAP;
        }
      }
      UNUSED(ret);
      UNUSED(p_gmap_info);
      break;
    }
  }
}

uint8_t GMAPAPP_StartAdvertising(CAP_Announcement_t AnnouncementType
                                 ,uint8_t EnableSolicitationRequest,
                                 uint16_t Appearance)
{
  tBleStatus status;
  uint8_t advPacketLen;
  uint8_t Primary_Adv_Channel_Map = ADV_CH_37 | ADV_CH_38 | ADV_CH_39;
  uint8_t Adv_TX_Power = 0x00;
  uint8_t Scan_Req_Notification_Enable = 0x00;
  uint8_t Secondary_Adv_Max_Skip = 0x00;
  const uint8_t Peer_Address[BD_ADDR_SIZE_LOCAL] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint8_t Pb_Addr_Len;
  uint8_t Pb_Addr[6] = {0x00};
  uint32_t Primary_Adv_Interval_Min;
  uint32_t Primary_Adv_Interval_Max;

  uint8_t Adv_Data[ADV_LEN] = {(ADV_AD_FLAGS_LEN-1), AD_TYPE_FLAGS, (FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE|FLAG_BIT_BR_EDR_NOT_SUPPORTED),
                               (ADV_LOCAL_NAME_LEN-1), AD_TYPE_COMPLETE_LOCAL_NAME,
                                 'S','T','M', '3', '2', 'W','B','A', '_', '0', '0', '0', '0'};
#if (CFG_TEST_VALIDATION == 1u)
  Adv_Data[5] = 'G';
  Adv_Data[6] = 'M';
  Adv_Data[7] = 'A';
  Adv_Data[8] = 'P';
  Adv_Data[9] = '_';
#endif /*(CFG_TEST_VALIDATION == 1u)*/
  aci_hal_read_config_data(CONFIG_DATA_PUBADDR_OFFSET, &Pb_Addr_Len, &Pb_Addr[0]);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-4] = Hex_To_Char((Pb_Addr[1] & 0xF0) >> 4);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-3] = Hex_To_Char(Pb_Addr[1] & 0x0F);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-2] = Hex_To_Char((Pb_Addr[0] & 0xF0) >> 4);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-1] = Hex_To_Char(Pb_Addr[0] & 0x0F);

  Menu_SetIdentifier((char *)&Adv_Data[ADV_AD_FLAGS_LEN+2], 14);

  /* Start Fast or Low Power Advertising.*/
  if (GMAPAPP_Context.NumConn == 0u)
  {
    Primary_Adv_Interval_Min = FAST_ADV_INTERVAL_MIN;
    Primary_Adv_Interval_Max = FAST_ADV_INTERVAL_MAX;
    LOG_INFO_APP("Start Fast Advertising\n");
  }
  else
  {
    Primary_Adv_Interval_Min = SLOW_ADV_INTERVAL_MIN;
    Primary_Adv_Interval_Max = SLOW_ADV_INTERVAL_MAX;
    LOG_INFO_APP("Start Slow Advertising\n");
  }
  status = aci_gap_adv_set_configuration(ADV_TYPE,
                                         0,
                                         HCI_ADV_EVENT_PROP_CONNECTABLE,
                                         Primary_Adv_Interval_Min,
                                         Primary_Adv_Interval_Max,
                                         Primary_Adv_Channel_Map,
                                         GAP_PUBLIC_ADDR,
                                         GAP_PUBLIC_ADDR,
                                         Peer_Address,
                                         ADV_FILTER,
                                         Adv_TX_Power,
                                         Secondary_Adv_Max_Skip,
                                         0x01,
                                         0,
                                         Scan_Req_Notification_Enable);
  LOG_INFO_APP("aci_gap_adv_set_configuration() returns status 0x%02X\n",status);
  if (status != BLE_STATUS_SUCCESS)
  {
    return status;
  }

  /* Set Extended Advertising data */
  GMAPAPP_BuildAdvDataPacket(&Adv_Data[(ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN)],
                            &advPacketLen,
                            AnnouncementType,
                            EnableSolicitationRequest,
                            Appearance);
  LOG_INFO_APP("CAP Advertising Packet (Length : %d) :\n", advPacketLen);

  status = hci_le_set_extended_advertising_data(0,
                                                HCI_SET_ADV_DATA_OPERATION_COMPLETE,
                                                0,
                                                (ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN+advPacketLen),
                                                &Adv_Data[0]);
  LOG_INFO_APP("hci_le_set_extended_advertising_data() returns status 0x%02X\n",status);
  if (status != BLE_STATUS_SUCCESS)
  {
    return status;
  }

  /* Enable Extended Advertising */
  Adv_Set_t adv_set;
  adv_set.Advertising_Handle = 0;
  adv_set.Duration = 0;
  adv_set.Max_Extended_Advertising_Events = 0;
  status = hci_le_set_extended_advertising_enable(0x01, 1, &adv_set);
  LOG_INFO_APP("hci_le_set_extended_advertising_enable() returns status 0x%02X\n",status);
  return status;
}

