STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
uint8_t GMAPAPP_StopAdvertising(void)
{
  Adv_Set_t adv_set;
  uint8_t status;
  adv_set.Advertising_Handle = 0;
  adv_set.Duration = 0;
  adv_set.Max_Extended_Advertising_Events = 0;

  status = hci_le_set_extended_advertising_enable(0, 1, &adv_set);

  return status;
}

uint8_t GMAPAPP_Disconnect(void)
{
  uint8_t status = HCI_COMMAND_DISALLOWED_ERR_CODE;
  for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
  {
    if (GMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle != 0xFFFFu)
    {
      status = hci_disconnect(GMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle,
                              HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE);
      LOG_INFO_APP("hci_disconnect() with ConnHandle 0x%04X return status: 0x%02X\n",
                   GMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle,
                   status);
    }
  }
  return status;
}

uint8_t GMAPAPP_VolumeUp(void)
{
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
  uint8_t status = BLE_STATUS_SUCCESS;
  uint8_t volume;
  if (Mute == 1)
  {
    status = VCP_RENDER_SetMuteState(0);
    LOG_INFO_APP("VCP_RENDER_SetMuteState() with Mute %d returns status 0x%02X\n", Mute, status);
  }

  if (0xFF - Volume > VOLUME_STEP)
  {
    volume = Volume + VOLUME_STEP;
  }
  else
  {
    volume = 0xFF;
  }

  if (status == BLE_STATUS_SUCCESS)
  {
    status = VCP_RENDER_SetAbsVolume(volume);
    LOG_INFO_APP("VCP_RENDER_SetAbsVolume() with volume %d returns status 0x%02X\n", volume, status);
  }
  return status;
#else /*#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

uint8_t GMAPAPP_VolumeDown(void)
{
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
  uint8_t status = BLE_STATUS_SUCCESS;
  uint8_t volume;

  if (Volume > VOLUME_STEP)
  {
    volume = Volume - VOLUME_STEP;
  }
  else
  {
    volume = 0;
    status = VCP_RENDER_SetMuteState(1);
    LOG_INFO_APP("VCP_RENDER_SetMuteState() with Mute %d returns status 0x%02X\n", Mute, status);
  }

  if (status == BLE_STATUS_SUCCESS)
  {
    status = VCP_RENDER_SetAbsVolume(volume);
    LOG_INFO_APP("VCP_RENDER_SetAbsVolume() with volume %d returns status 0x%02X\n", volume, status);
  }
  return status;
#else /*#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

uint8_t GMAPAPP_ToggleMute(void)
{
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
  uint8_t status;

  Mute = (Mute + 1) % 2;

  status = VCP_RENDER_SetMuteState(Mute);
  LOG_INFO_APP("VCP_RENDER_SetMuteState() returns status 0x%02X\n",status);

  return status;
#else /*#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

uint8_t GMAPAPP_ToggleMicrophoneMute(void)
{
#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1u)
  uint8_t status;

  MicMute = (MicMute + 1) % 2;

  status = MICP_DEVICE_SetMute(MicMute);
  LOG_INFO_APP("MICP_DEVICE_SetMute() with Mute State %d returns status 0x%02X\n",MicMute,status);

  if (status == BLE_STATUS_SUCCESS)
  {
    Menu_SetMicMute(MicMute);
  }

  return status;
#else /*#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

/**
  * @brief The BLE Audio Stack requests to be executed. BLE_AUDIO_STACK_Task() shall be called.
  * @note  If the Host task is executed in a separate thread, the thread shall be unlocked here.
  */
void BLE_AUDIO_STACK_NotifyToRun(void)
{
  APP_NotifyToRun();
}

void APP_NotifyTxAudioCplt(uint16_t AudioFrameSize)
{
  uint8_t i;
  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (GMAPAPP_Context.cis_snk_handle[i] != 0xFFFFu)
    {
      CODEC_ReceiveData(GMAPAPP_Context.cis_snk_handle[i], 1, &aSnkBuff[0] + AudioFrameSize/2 + i);
    }
  }
#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
  if (GMAPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SINK)
  {
    if (GMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_SYNCHRONIZED)
    {
      for (i = 0; i< GMAPAPP_Context.BSNK.current_num_bis; i++)
      {
        CODEC_ReceiveData(GMAPAPP_Context.BSNK.current_BIS_conn_handles[i], 1, &aSnkBuff[0]  + AudioFrameSize/2 + i);
      }
    }
  }
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
}

void APP_NotifyTxAudioHalfCplt(void)
{
  uint8_t i;
  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (GMAPAPP_Context.cis_snk_handle[i] != 0xFFFFu)
    {
      CODEC_ReceiveData(GMAPAPP_Context.cis_snk_handle[i], 1, &aSnkBuff[0] + i);
    }
  }
#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
  if (GMAPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SINK)
  {
    if (GMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_SYNCHRONIZED)
    {
      for (i = 0; i< GMAPAPP_Context.BSNK.current_num_bis; i++)
      {
        CODEC_ReceiveData(GMAPAPP_Context.BSNK.current_BIS_conn_handles[i], 1, &aSnkBuff[0] + i);
      }
    }
  }
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
}

extern uint32_t Sink_frame_size;

void CODEC_NotifyDataReady(uint16_t conn_handle, void* decoded_data)
{
  /* When only one channel is active, duplicate it for fake stereo on SAI */
  uint32_t i;
  uint8_t j;
  uint16_t *pData = (uint16_t *)(decoded_data);   /* 16 bits samples */

  if(pData == (pPrevData + 1)){
    /* we start receiving two channels */
    Nb_Active_Ch = 2;
  }
  pPrevData = pData;

  if (Nb_Active_Ch < 2)
  {
    for (i = 0; i < Sink_frame_size/2; i+=2*GMAPAPP_Context.SinkDecimation)
    {
      /* decoded_data is organized with a decimation equal to 2, so we duplicate each sample */
      pData[i+1] = pData[i];

      /* When Decimation multiplier is more than one, copy sample to adjacent empty samples */
      for (j = 1; j < GMAPAPP_Context.SinkDecimation; j++)
      {
        pData[i+2*j] = pData[i];
        pData[i+2*j+1] = pData[i];
      }
    }
  }
}

extern uint32_t Source_frame_size;

void APP_NotifyRxAudioCplt(uint16_t AudioFrameSize)
{
  uint8_t i;

  if (MicMute == 1)
  {
    /* Invalidate Rx data if microphone is mute */
    MEMSET(&aSrcBuff[0] + Source_frame_size/2, 0, Source_frame_size);
  }

  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (GMAPAPP_Context.cis_src_handle[i] != 0xFFFFu)
    {
      CODEC_SendData(GMAPAPP_Context.cis_src_handle[i], 1, &aSrcBuff[0] + AudioFrameSize/2 + i);
    }
  }
}

void APP_NotifyRxAudioHalfCplt(void)
{
  uint8_t i;

  if (MicMute == 1)
  {
    /* Invalidate Rx data if microphone is mute */
    MEMSET(&aSrcBuff[0], 0, Source_frame_size);
  }

  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (GMAPAPP_Context.cis_src_handle[i] != 0xFFFFu)
    {
      CODEC_SendData(GMAPAPP_Context.cis_src_handle[i], 1, &aSrcBuff[0]+i);
    }
  }
}

void GMAPAPP_AclConnected(uint16_t ConnHandle, uint8_t Peer_Address_Type, uint8_t Peer_Address[6], uint8_t role)
{
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(ConnHandle);
  if (p_conn == 0)
  {
    p_conn = APP_AllocateConn(ConnHandle);
  }
  if (p_conn != 0)
  {
    p_conn->AudioProfile = AUDIO_PROFILE_NONE;
    p_conn->Peer_Address_Type = Peer_Address_Type;
    for (uint8_t i = 0 ; i < 6u; i++)
    {
      p_conn->Peer_Address[i] = Peer_Address[i];
    }
    p_conn->Role = role;
    for (uint8_t i = 0; i < CFG_BLE_NUM_LINK;i++)
    {
      if (GMAPAPP_Context.aASEs[i].acl_conn_handle == 0xFFFFu)
      {
        p_conn->pASEs = &GMAPAPP_Context.aASEs[i];
        p_conn->pASEs->acl_conn_handle = ConnHandle;
        break;
      }
    }
  }
  /* Set Available Audio Contexts */
  p_conn->AvailableSnkAudioContext = GMAPAPP_Context.AvailableSnkAudioContext;
  p_conn->AvailableSrcAudioContext = GMAPAPP_Context.AvailableSrcAudioContext;

  GMAPAPP_Context.NumConn++;
  if (GMAPAPP_Context.NumConn < CFG_BLE_NUM_LINK )
  {
    tBleStatus status;
    GMAPAPP_StopAdvertising();
    /* Start Advertising */
    if (GMAPAPP_Context.CSIPRank > 0)
    {
      status = GMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, 0, GAP_APPEARANCE_EARBUD);
    }
    else
    {
      status = GMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, 0, GAP_APPEARANCE_HEADPHONES);
    }
    LOG_INFO_APP("GMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
    UNUSED(status);
  }
}

void GMAPAPP_ConfirmIndicationRequired(uint16_t Conn_Handle)
{
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(Conn_Handle);
  if (p_conn != 0)
  {
    p_conn->ConfirmIndicationRequired = 1u;
  }
}

void GMAPAPP_BondLost(uint16_t Conn_Handle)
{
  /* Nothing to do */
}

void GMAPAPP_CISConnected(uint16_t Conn_Handle)
{
  for (uint8_t i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (GMAPAPP_Context.cis_handle[i] == 0xFFFFu)
    {
      GMAPAPP_Context.cis_handle[i] = Conn_Handle;
      GMAPAPP_Context.num_cis_established++;
      break;
    }
  }
}

void GMAPAPP_LinkDisconnected(uint16_t Conn_Handle,uint8_t Reason)
{
  uint8_t i;
  uint8_t status;
  Audio_Context_t snk_context = 0x0000;
  Audio_Context_t src_context = 0x0000;

