STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(Conn_Handle);
  if (p_conn != 0)
  {
    /*Free CAP Connection Slot*/
    p_conn->Acl_Conn_Handle = 0xFFFFu;
    p_conn->AudioProfile = AUDIO_PROFILE_NONE;
    p_conn->ConfirmIndicationRequired = 0u;
    GMAPAPP_Context.NumConn--;

#if (APP_NUM_SNK_ASE > 0u)
    for ( i = 0; i < APP_NUM_SNK_ASE;i++)
    {
      if (p_conn->pASEs->aSnkASE[i].allocated != 0x00)
      {
        if ( p_conn->pASEs->aSnkASE[i].streaming_audio_context != 0x0000u)
        {
          /* Calculate the available Audio Contexts now ASEs have 'released' streaming audio contexts */
          snk_context |= APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                               &p_conn->pASEs->aSnkASE[i],
                                                               p_conn->pASEs->aSnkASE[i].streaming_audio_context);
        }
        LOG_INFO_APP("Free ASE ID %d on ACL connection handle 0x%04X\n",p_conn->pASEs->aSnkASE[i].ID,Conn_Handle);
        p_conn->pASEs->aSnkASE[i].ID = 0x00;
        p_conn->pASEs->aSnkASE[i].state  = ASE_STATE_IDLE;
        p_conn->pASEs->aSnkASE[i].num_channels  = 0x00;
        p_conn->pASEs->aSnkASE[i].streaming_audio_context = 0x00u;
        p_conn->pASEs->aSnkASE[i].allocated = 0x00u;
      }
    }
#endif /*(APP_NUM_SNK_ASE > 0u)*/
#if (APP_NUM_SRC_ASE > 0u)
    for ( i = 0; i < APP_NUM_SRC_ASE;i++)
    {
      if (p_conn->pASEs->aSrcASE[i].allocated != 0x00)
      {
        if ( p_conn->pASEs->aSrcASE[i].streaming_audio_context != 0x0000u)
        {
          /* Calculate the available Audio Contexts now ASEs have 'released' streaming audio contexts */
          src_context |= APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                               &p_conn->pASEs->aSrcASE[i],
                                                               p_conn->pASEs->aSrcASE[i].streaming_audio_context);
        }
        LOG_INFO_APP("Free ASE ID %d on ACL connection handle 0x%04X\n",p_conn->pASEs->aSrcASE[i].ID,Conn_Handle);
        p_conn->pASEs->aSrcASE[i].ID = 0x00;
        p_conn->pASEs->aSrcASE[i].state  = ASE_STATE_IDLE;
        p_conn->pASEs->aSrcASE[i].num_channels  = 0x00;
        p_conn->pASEs->aSrcASE[i].streaming_audio_context = 0x00u;
        p_conn->pASEs->aSrcASE[i].allocated = 0x00u;
      }
    }
#endif /*(APP_NUM_SRC_ASE > 0u)*/

    p_conn->pASEs->acl_conn_handle = 0xFFFFu;
    p_conn->pASEs = 0;
    p_conn->AvailableSnkAudioContext = 0x0000u;
    p_conn->AvailableSrcAudioContext = 0x0000u;

    /* if context are now available, update them */
    if ((snk_context != 0x0000) || (src_context != 0x0000) )
    {
      uint8_t enable_ongoing = 0u;
      APP_ACL_Conn_t *p_other_conn;

      GMAPAPP_Context.AvailableSnkAudioContext |= snk_context;
      GMAPAPP_Context.AvailableSrcAudioContext |= src_context;

      /* Check if all supported audio contexts are now available and so AUDIO_CONTEXT_UNSPECIFIED should be also
       * set as available.
       */
      if (snk_context != 0x0000)
      {
        /*Check if "Unspecified Audio Context" should be add in available Audio Contexts now*/
        if ( (GMAPAPP_Context.AvailableSnkAudioContext | AUDIO_CONTEXT_UNSPECIFIED) == SUPPORTED_SNK_CONTEXTS)
        {
          GMAPAPP_Context.AvailableSnkAudioContext |= AUDIO_CONTEXT_UNSPECIFIED;
        }
      }
      if (src_context != 0x0000)
      {
        /*Check if "Unspecified Audio Context" should be add in available Audio Contexts now*/
        if ( (GMAPAPP_Context.AvailableSrcAudioContext | AUDIO_CONTEXT_UNSPECIFIED) == SUPPORTED_SRC_CONTEXTS)
        {
          GMAPAPP_Context.AvailableSrcAudioContext |= AUDIO_CONTEXT_UNSPECIFIED;
        }
      }

      status = CAP_SetAvailableAudioContexts(GMAPAPP_Context.AvailableSnkAudioContext,
                                             GMAPAPP_Context.AvailableSrcAudioContext);
      if (status == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                     GMAPAPP_Context.AvailableSnkAudioContext,
                     GMAPAPP_Context.AvailableSrcAudioContext);
      }
      else
      {
        LOG_INFO_APP("FAILURE to Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                     GMAPAPP_Context.AvailableSnkAudioContext,
                     GMAPAPP_Context.AvailableSrcAudioContext);
      }
      /*check if a reponse to an Enable operation Request is suspended with another CAP Initiator*/
      for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
      {
        if ((GMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) && (&GMAPAPP_Context.ACL_Conn[conn] != p_conn))
        {
          p_other_conn = &GMAPAPP_Context.ACL_Conn[conn];
#if (APP_NUM_SNK_ASE > 0u)
          for ( uint8_t i = 0; i < GMAPAPP_Context.NumSnkASEs;i++)
          {
            if (p_other_conn->pASEs->aSnkASE[i].allocated == 1)
            {
              if (p_other_conn->pASEs->aSnkASE[i].enable_req == 1)
              {
                enable_ongoing = 1u;
                /* Send an reponse to the Enable Operation request if no CIS is still up*/
                if (GMAPAPP_Context.num_cis_established == 0u)
                {
                  status = CAP_Unicast_EnableOpRsp(p_other_conn->Acl_Conn_Handle,
                                                   p_other_conn->pASEs->aSnkASE[i].ID,
                                                   ASE_OP_RESP_SUCCESS,
                                                   ASE_OP_RESP_NO_REASON);
                  if (status != BLE_STATUS_SUCCESS)
                  {
                    LOG_INFO_APP("  Fail   : Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                 status,
                                 p_other_conn->pASEs->aSnkASE[i].ID,
                                 p_other_conn->Acl_Conn_Handle);
                  }
                  else
                  {
                    LOG_INFO_APP("  Success: Enable Operation Response for ASE ID %d on ConnHandle 0x%04X\n",
                                 p_other_conn->pASEs->aSnkASE[i].ID,
                                 p_other_conn->Acl_Conn_Handle);
                  }
                }
              }
            }
          }
#endif /* (APP_NUM_SNK_ASE > 0u) */
#if (APP_NUM_SRC_ASE > 0u)
          for ( uint8_t i = 0; i < GMAPAPP_Context.NumSrcASEs;i++)
          {
            if (p_other_conn->pASEs->aSrcASE[i].allocated == 1)
            {
              if (p_other_conn->pASEs->aSrcASE[i].enable_req == 1)
              {
                enable_ongoing = 1u;
                /* Send an reponse to the Enable Operation request if no CIS is still up*/
                if (GMAPAPP_Context.num_cis_established == 0u)
                {
                  status = CAP_Unicast_EnableOpRsp(p_other_conn->Acl_Conn_Handle,
                                p_other_conn->pASEs->aSrcASE[i].ID,
                                ASE_OP_RESP_SUCCESS,
                                ASE_OP_RESP_NO_REASON);
                  if (status != BLE_STATUS_SUCCESS)
                  {
                    LOG_INFO_APP("  Fail   : Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                 status,
                                 p_other_conn->pASEs->aSrcASE[i].ID,
                                 p_other_conn->Acl_Conn_Handle);
                  }
                  else
                  {
                    LOG_INFO_APP("  Success: Enable Operation Response for ASE ID %d on ConnHandle 0x%04X\n",
                                 p_other_conn->pASEs->aSrcASE[i].ID,
                                 p_other_conn->Acl_Conn_Handle);
                  }
                }
              }
            }
          }
#endif /* (APP_NUM_SRC_ASE > 0u) */
        }
      }
      /* Check if no response to an Enable Request is in progress to update Audio Contexts availability to
      * the connected CAP Initiators.
      */
      if (enable_ongoing == 0u)
      {
        for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
        {
          if (GMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
          {
            p_other_conn = &GMAPAPP_Context.ACL_Conn[conn];
            if ((p_other_conn->AvailableSnkAudioContext != GMAPAPP_Context.AvailableSnkAudioContext) \
                || (p_other_conn->AvailableSrcAudioContext != GMAPAPP_Context.AvailableSrcAudioContext))
            {
              /*update the available Audio Contexts of the all the connected CAP Initiators*/
              status = CAP_UpdateAvailableAudioContexts(p_other_conn->Acl_Conn_Handle,
                                                        GMAPAPP_Context.AvailableSnkAudioContext,
                                                        GMAPAPP_Context.AvailableSrcAudioContext);
              LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                           GMAPAPP_Context.AvailableSnkAudioContext,
                           GMAPAPP_Context.AvailableSrcAudioContext,
                           p_other_conn->Acl_Conn_Handle,
                           status);
              p_other_conn->AvailableSnkAudioContext = GMAPAPP_Context.AvailableSnkAudioContext;
              p_other_conn->AvailableSrcAudioContext = GMAPAPP_Context.AvailableSrcAudioContext;
              UNUSED(status);
            }
            else
            {
              LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                           GMAPAPP_Context.AvailableSnkAudioContext,
                           GMAPAPP_Context.AvailableSrcAudioContext,
                           p_other_conn->Acl_Conn_Handle);
            }
          }
        }
      }
    }
    /* Check if the disconnection is issued to a local User action*/
    if (Reason != HCI_CONNECTION_TERMINATED_BY_LOCAL_HOST_ERR_CODE)
    {
      GMAPAPP_StopAdvertising();
      /* Start Advertising */
      if (GMAPAPP_Context.CSIPRank > 0)
      {
        status = GMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, 0, GAP_APPEARANCE_EARBUD);
      }
      else
      {
        status = GMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, 0, GAP_APPEARANCE_HEADPHONES);
      }
      LOG_INFO_APP("GMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
      Menu_SetWaitConnPage();
    }
    else
    {
      GMAPAPP_StopAdvertising();
      Menu_SetStartupPage();
    }
    UNUSED(status);
  }
  else
  {
    /* Check if the Connection Handle corresponds to a CIS link */
    for (uint8_t i = 0; i< APP_MAX_NUM_CIS; i++)
    {
      if (GMAPAPP_Context.cis_handle[i] == Conn_Handle)
      {
        GMAPAPP_Context.cis_handle[i] = 0xFFFFu;
        GMAPAPP_Context.num_cis_established--;
        if (GMAPAPP_Context.num_cis_established == 0u)
        {
          LOG_INFO_APP("Deinitialized Audio Peripherals\n");
          MX_AudioDeInit();
#if (CFG_LCD_SUPPORTED == 1)
          Menu_SetNoStreamPage();
#endif /* (CFG_LCD_SUPPORTED == 1) */
          /*check if a reponse to an Enable operation Request is suspended with another CAP Initiator*/
          for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
          {
            if (GMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
            {
              p_conn = &GMAPAPP_Context.ACL_Conn[conn];
#if (APP_NUM_SNK_ASE > 0u)
              for ( uint8_t i = 0; i < GMAPAPP_Context.NumSnkASEs;i++)
              {
                if (p_conn->pASEs->aSnkASE[i].allocated == 1)
                {
                  if (p_conn->pASEs->aSnkASE[i].enable_req == 1)
                  {
                    status = CAP_Unicast_EnableOpRsp(p_conn->Acl_Conn_Handle,
                                  p_conn->pASEs->aSnkASE[i].ID,
                                  ASE_OP_RESP_SUCCESS,
                                  ASE_OP_RESP_NO_REASON);
                    LOG_INFO_APP("Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                status,
                                p_conn->pASEs->aSnkASE[i].ID,
                                p_conn->Acl_Conn_Handle);
                  }
                }
              }
#endif /* (APP_NUM_SNK_ASE > 0u) */
#if (APP_NUM_SRC_ASE > 0u)
              for ( uint8_t i = 0; i < GMAPAPP_Context.NumSrcASEs;i++)
              {
                if (p_conn->pASEs->aSrcASE[i].allocated == 1)
                {
                  if (p_conn->pASEs->aSrcASE[i].enable_req == 1)
                  {
                    status = CAP_Unicast_EnableOpRsp(p_conn->Acl_Conn_Handle,
                                  p_conn->pASEs->aSrcASE[i].ID,
                                  ASE_OP_RESP_SUCCESS,
                                  ASE_OP_RESP_NO_REASON);
                    LOG_INFO_APP("Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                status,
                                p_conn->pASEs->aSrcASE[i].ID,
                                p_conn->Acl_Conn_Handle);
                  }
                }
              }
#endif /* (APP_NUM_SRC_ASE > 0u) */
            }
          }
        }
        break;
      }
    }
  }
}

uint8_t GMAPAPP_SyncToPA(uint8_t AdvSID, uint8_t *pAdvAddress, uint8_t AdvAddressType)
{
#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
  uint8_t status;
  GMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_SYNCHRONIZING;
  status = CAP_Broadcast_StartPASync(AdvSID,
                                     pAdvAddress,
                                     AdvAddressType,
                                     PA_EVENT_SKIP,
                                     PA_SYNC_TIMEOUT);
  LOG_INFO_APP("==>> Starting Broadcasting DiscoveryDevice with Source %02X:%02X:%02X:%02X:%02X:%02X\n",
                    pAdvAddress[5],
                    pAdvAddress[4],
                    pAdvAddress[3],
                    pAdvAddress[2],
                    pAdvAddress[1],
                    pAdvAddress[0]);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : CAP_Broadcast_StartPASync() function, result: 0x%02X\n", status);
  }
  else
  {
    LOG_INFO_APP("  Success: CAP_Broadcast_StartPASync() function\n");
  }

