STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
  return status;
#else /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
  return HCI_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE_ERR_CODE;
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
}

uint8_t GMAPAPP_StartSink(void)
{
#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
  uint8_t ret;

  LOG_INFO_APP(">>==  Start Sink\n");

  ret = CAP_Broadcast_StartAdvReportParsing();
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : CAP_Broadcast_StartAdvReportParsing() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: CAP_Broadcast_StartAdvReportParsing() function\n");
  }

  if (ret == BLE_STATUS_SUCCESS)
  {
    Scan_Param_Phy_t scan_param_phy;
    scan_param_phy.Scan_Type     = 0x00; /*Passive scanning*/
    scan_param_phy.Scan_Interval = SCAN_INTERVAL;
    scan_param_phy.Scan_Window   = SCAN_WINDOW;
    /* Starts an Observation procedure */
    ret = aci_gap_ext_start_scan( 0x00,
                                  GAP_OBSERVATION_PROC,
                                  0x00,                         /* Address type: Public */
                                  0x00,                         /* Filter duplicates: No */
                                  0x00,                         /* Scan continuously until explicitly disable */
                                  0x00,                         /* Scan continuously */
                                  0x00,                         /* Filter policy: Accept all */
                                  HCI_SCANNING_PHYS_LE_1M,
                                  &scan_param_phy);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : aci_gap_ext_start_scan() function with Scan procedure 0x%02X, result: 0x%02X\n",
                   GAP_OBSERVATION_PROC,
                   ret);
    }
    else
    {
      LOG_INFO_APP("  Success: aci_gap_ext_start_scan() function with Scan procedure 0x%02X\n",
                   GAP_OBSERVATION_PROC);
      GMAPAPP_Context.BSNK.ScanState = APP_SCAN_STATE_SCANNING;
    }
  }

  return ret;
#else /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
  return HCI_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE_ERR_CODE;
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
}

uint8_t GMAPAPP_StopSink(void)
{
#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
  uint8_t ret = BLE_STATUS_SUCCESS;

  LOG_INFO_APP(">>==  Start Stop Broadcast Sink\n");

  if (GMAPAPP_Context.BSNK.ScanState == APP_SCAN_STATE_SCANNING)
  {
    ret = aci_gap_terminate_gap_proc(GAP_OBSERVATION_PROC);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : aci_gap_terminate_gap_proc() function, result: 0x%02X\n", ret);
    }
    else
    {
      GMAPAPP_Context.BSNK.ScanState = APP_SCAN_STATE_IDLE;
      LOG_INFO_APP("  Success: aci_gap_terminate_gap_proc() function\n");
    }
  }

  if (GMAPAPP_Context.BSNK.PASyncState != APP_PA_SYNC_STATE_IDLE)
  {
    ret = CAP_Broadcast_StopPASync(GMAPAPP_Context.BSNK.PASyncHandle);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : CAP_Broadcast_StopPASync() function, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: CAP_Broadcast_StopPASync() function\n");
      GMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_IDLE;
    }
  }

  if (GMAPAPP_Context.BSNK.PASyncState != APP_PA_SYNC_STATE_IDLE)
  {
    ret = CAP_Broadcast_StopPASync(GMAPAPP_Context.BSNK.PASyncHandle);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : CAP_Broadcast_StopPASync() function, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: CAP_Broadcast_StopPASync() function\n");
      GMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_IDLE;
    }
  }

  if (GMAPAPP_Context.BSNK.BIGSyncState != APP_BIG_SYNC_STATE_IDLE)
  {
    ret = CAP_Broadcast_StopBIGSync(BIG_HANDLE);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : CAP_Broadcast_StopBIGSync() function, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: CAP_Broadcast_StopBIGSync() function\n");
      GMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_IDLE;
    }
  }

  LOG_INFO_APP("   >>==  MX_AudioDeInit()\n");
  MX_AudioDeInit();

  LOG_INFO_APP(">>==  End Stop Broadcast Sink\n");
  return ret;

#else /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
  return HCI_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE_ERR_CODE;
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
}

void GMAPAPP_SetBroadcastMode(APP_BroadcastMode_t mode)
{
  GMAPAPP_Context.BroadcastMode = mode;
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

static tBleStatus CAPAPP_Init(Audio_Role_t AudioRole, uint8_t csip_config_id)
{
  tBleStatus status;
  Audio_Role_t audio_role = 0;
  Audio_Context_t available_snk_context = 0;
  Audio_Context_t available_src_context = 0;
  Audio_Context_t supported_snk_context = 0;
  Audio_Context_t supported_src_context = 0;
#if (APP_NUM_SNK_PAC_RECORDS > 0u)
  uint8_t a_snk_cap_id[MIN_NUM_BAP_SNK_CODEC_CAP] = BAP_MANDATORY_SNK_CODEC_CAP_LIST;
  uint8_t num_snk_capabilities = 0;
#endif /*(APP_NUM_SNK_PAC_RECORDS > 0u)*/
#if (APP_NUM_SRC_PAC_RECORDS > 0u)
  uint8_t a_src_cap_id[MIN_NUM_BAP_SRC_CODEC_CAP] = BAP_MANDATORY_SRC_CODEC_CAP_LIST;
  uint8_t num_src_capabilities = 0;
#endif /*(APP_NUM_SRC_PAC_RECORDS > 0u)*/
  Audio_Location_t audio_locations = FRONT_LEFT;

  LOG_INFO_APP("CAPAPP_Init() with audio role 0x%02X\n",AudioRole);

  /* Initialize the Audio IP*/
  pBleAudioInit.NumOfLinks = CFG_BLE_NUM_LINK;
  pBleAudioInit.bleStartRamAddress = (uint8_t*)audio_init_buffer;
  pBleAudioInit.total_buffer_size = BLE_AUDIO_DYN_ALLOC_SIZE;
  status = BLE_AUDIO_STACK_Init(&pBleAudioInit);
  LOG_INFO_APP("BLE_AUDIO_STACK_Init() returns status 0x%02X\n",status);
  LOG_INFO_APP("BLE Audio Stack Lib version: %s\n",BLE_AUDIO_STACK_GetFwVersion());
  if(status != BLE_STATUS_SUCCESS)
  {
    return status;
  }

