STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
  GMAPAPP_Context.bap_role = APP_BAP_Config.Role;

  GMAPAPP_Context.NumConn = 0;

  for (uint8_t conn = 0; conn< CFG_BLE_NUM_LINK; conn++)
  {
    GMAPAPP_Context.aASEs[conn].acl_conn_handle = 0xFFFFu;
#if (APP_NUM_SNK_ASE > 0u)
    for (uint8_t i = 0; i< APP_NUM_SNK_ASE; i++)
    {
      GMAPAPP_Context.aASEs[conn].aSnkASE[i].ID = 0x00;
      GMAPAPP_Context.aASEs[conn].aSnkASE[i].type = ASE_SINK;
      GMAPAPP_Context.aASEs[conn].aSnkASE[i].state  = ASE_STATE_IDLE;
      GMAPAPP_Context.aASEs[conn].aSnkASE[i].num_channels  = 0x00;
      GMAPAPP_Context.aASEs[conn].aSnkASE[i].streaming_audio_context = 0x00u;
      GMAPAPP_Context.aASEs[conn].aSnkASE[i].allocated = 0x00u;
    }
#endif /*(APP_NUM_SNK_ASE > 0u)*/

#if (APP_NUM_SRC_ASE > 0u)
    for (uint8_t i = 0; i< APP_NUM_SRC_ASE; i++)
    {
      GMAPAPP_Context.aASEs[conn].aSrcASE[i].ID = 0x00;
      GMAPAPP_Context.aASEs[conn].aSrcASE[i].state  = ASE_STATE_IDLE;
      GMAPAPP_Context.aASEs[conn].aSrcASE[i].type = ASE_SOURCE;
      GMAPAPP_Context.aASEs[conn].aSrcASE[i].num_channels  = 0x00;
      GMAPAPP_Context.aASEs[conn].aSrcASE[i].streaming_audio_context = 0x00u;
      GMAPAPP_Context.aASEs[conn].aSrcASE[i].allocated = 0x00u;
    }
#endif /*(APP_NUM_SRC_ASE > 0u)*/
    GMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle = 0xFFFFu;
    GMAPAPP_Context.ACL_Conn[conn].AudioProfile = AUDIO_PROFILE_NONE;
    GMAPAPP_Context.ACL_Conn[conn].AvailableSnkAudioContext = 0x0000u;
    GMAPAPP_Context.ACL_Conn[conn].AvailableSrcAudioContext = 0x0000u;
  }

  /*Register the Audio Task */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_AUDIO_ID, UTIL_SEQ_RFU, BLE_AUDIO_STACK_Task);
  /*Initialize the Audio Codec (LC3)*/
  CODEC_LC3Config_t lc3_config;

  lc3_config.SessionSize = sizeof(aLC3SessionMemBuffer);
  lc3_config.ChannelSize = sizeof(aLC3ChannelMemBuffer);
  lc3_config.StackSize = sizeof(aLC3StackMemBuffer);

  lc3_config.pSessionStart = aLC3SessionMemBuffer;
  lc3_config.pChannelStart = aLC3ChannelMemBuffer;
  lc3_config.pStackStart = aLC3StackMemBuffer;

  CODEC_ManagerInit(sizeof(aCodecPacketsMemory),
                        (uint8_t*)aCodecPacketsMemory,
                        &lc3_config,
                        CODEC_PROC_MARGIN_US,
                        CODEC_RF_SETUP_US,
                        CODEC_MODE_DEFAULT);

  /*Enable Audio Codec in LE Controller */
  GMAPAPP_Context.aStandardCodec[0].CodingFormat = AUDIO_CODING_FORMAT_LC3;
  GMAPAPP_Context.aStandardCodec[0].TransportMask = 0x03; /* CIS+BIS Transport Type */
  GMAPAPP_Context.AudioCodecInController.NumStandardCodecs = 0x01;
  GMAPAPP_Context.AudioCodecInController.pStandardCodec = &GMAPAPP_Context.aStandardCodec[0];
  GMAPAPP_Context.AudioCodecInController.NumVendorSpecificCodecs = 0x00;
  GMAPAPP_Context.AudioCodecInController.pVendorSpecificCodec = (void *)0;

  status = CAP_EnableAudioCodecController(&GMAPAPP_Context.AudioCodecInController);
  LOG_INFO_APP("Enable Audio Codec in LE Controller status 0x%02X\n",status);
  if (status != BLE_STATUS_SUCCESS)
  {
    return status;
  }

  /*Initialize Flags of the APP Context*/
  GMAPAPP_Context.audio_role_setup = 0x00;
  GMAPAPP_Context.num_cis_src = 0;
  GMAPAPP_Context.num_cis_snk = 0;
  GMAPAPP_Context.audio_role_setup = 0x00;
  GMAPAPP_Context.num_cis_src = 0;
  GMAPAPP_Context.num_cis_snk = 0;

#if (APP_NUM_SNK_ASE >= 1)
  audio_role |= AUDIO_ROLE_SINK;
  supported_snk_context = SUPPORTED_SNK_CONTEXTS;
  available_snk_context = SUPPORTED_SNK_CONTEXTS;
#if (APP_NUM_SNK_PAC_RECORDS > 0u)
  /* 2 Audio Sink Mandatory codec specific capabilities */
  num_snk_capabilities = MIN_NUM_BAP_SNK_CODEC_CAP;
#endif /* (APP_NUM_SNK_PAC_RECORDS > 0u) */
#else /* (APP_NUM_SNK_ASE >= 1) */
   supported_snk_context = AUDIO_CONTEXT_UNSPECIFIED;
   available_snk_context = AUDIO_CONTEXT_UNSPECIFIED;
#endif /* (APP_NUM_SNK_ASE >= 1) */

#if (APP_NUM_SRC_ASE >= 1)
  audio_role |= AUDIO_ROLE_SOURCE;
  supported_src_context = SUPPORTED_SRC_CONTEXTS;
  available_src_context = SUPPORTED_SRC_CONTEXTS;
#if (APP_NUM_SRC_PAC_RECORDS > 0u)
  num_src_capabilities = MIN_NUM_BAP_SRC_CODEC_CAP; /* 1 Audio Source Mandatory codec specific capabilities */
#endif /* (APP_NUM_SRC_PAC_RECORDS > 0u) */
#else /* (APP_NUM_SRC_ASE >= 1) */
  supported_src_context = AUDIO_CONTEXT_UNSPECIFIED;
  available_src_context = AUDIO_CONTEXT_UNSPECIFIED;
#endif /* (APP_NUM_SRC_ASE >= 1) */

  /*Set Codec ID configuration*/
  if (audio_role & AUDIO_ROLE_SINK)
  {
#if (APP_NUM_SNK_PAC_RECORDS > 0u)
    Audio_Context_t preferred_audio_context = AUDIO_CONTEXT_MEDIA;
    /* Register the Sink Codec Capabilities */
    /*Set Codec ID configuration*/
    GMAPAPP_Context.aSnkPACRecord[0].Cap.CodecID.CodingFormat = AUDIO_CODING_FORMAT_LC3;
    GMAPAPP_Context.aSnkPACRecord[0].Cap.CodecID.CompanyID = COMPANY_ID;
    GMAPAPP_Context.aSnkPACRecord[0].Cap.CodecID.VsCodecID = 0x0000;

    /* Set supported codec capabilities configuration */
    GMAPAPP_Context.aSnkCap[0][0] = 0x03;
    GMAPAPP_Context.aSnkCap[0][1] = CODEC_CAP_SAMPLING_FREQ;
    for (uint8_t i = 0; i < num_snk_capabilities ;i++)
    {
      GMAPAPP_Context.aSnkCap[0][2] |= (uint8_t) (APP_CodecSpecificCap[a_snk_cap_id[i]].Freq);
      GMAPAPP_Context.aSnkCap[0][3] |= (uint8_t) ((APP_CodecSpecificCap[a_snk_cap_id[i]].Freq >> 8 ));
      if (APP_CodecSpecificCap[a_snk_cap_id[i]].Freq == SUPPORTED_SAMPLE_FREQ_16000_HZ)
      {
        preferred_audio_context = AUDIO_CONTEXT_CONVERSATIONAL;
      }
    }

    GMAPAPP_Context.aSnkCap[0][4] = 0x02;
    GMAPAPP_Context.aSnkCap[0][5] = CODEC_CAP_FRAME_DURATION;
    for (uint8_t i = 0; i < num_snk_capabilities ;i++)
    {
      GMAPAPP_Context.aSnkCap[0][6] |= APP_CodecSpecificCap[a_snk_cap_id[i]].FrameDuration;
    }

    GMAPAPP_Context.aSnkCap[0][7] = 0x05;
    GMAPAPP_Context.aSnkCap[0][8] = CODEC_CAP_OCTETS_PER_CODEC_FRAME;
    for (uint8_t i = 0; i < num_snk_capabilities ;i++)
    {
      uint32_t min_octet_per_codec_frame = APP_CodecSpecificCap[a_snk_cap_id[i]].MinOctetsPerCodecFrame;
      uint32_t max_octet_per_codec_frame = APP_CodecSpecificCap[a_snk_cap_id[i]].MaxOctetsPerCodecFrame;

