STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
      if (i > 0)
      {
        min_octet_per_codec_frame = MIN(min_octet_per_codec_frame,
                                        GMAPAPP_Context.aSnkCap[0][9] + (GMAPAPP_Context.aSnkCap[0][10] << 8));
        max_octet_per_codec_frame = MAX(max_octet_per_codec_frame,
                                        GMAPAPP_Context.aSnkCap[0][11] + (GMAPAPP_Context.aSnkCap[0][12] << 8));
      }

      GMAPAPP_Context.aSnkCap[0][9] = (uint8_t) (min_octet_per_codec_frame);
      GMAPAPP_Context.aSnkCap[0][10] = (uint8_t) (min_octet_per_codec_frame >> 8 );
      GMAPAPP_Context.aSnkCap[0][11] = (uint8_t) (max_octet_per_codec_frame);
      GMAPAPP_Context.aSnkCap[0][12] = (uint8_t) (max_octet_per_codec_frame >> 8);
    }

    GMAPAPP_Context.aSnkCap[0][13] = 0x02;
    GMAPAPP_Context.aSnkCap[0][14] = CODEC_CAP_AUDIO_CHNL_COUNTS;
    GMAPAPP_Context.aSnkCap[0][15] = (APP_MAX_CHANNEL_PER_SNK_ASE | SUPPORTED_AUDIO_CHNL_COUNT_1);

    GMAPAPP_Context.aSnkPACRecord[0].Cap.pSpecificCap = &GMAPAPP_Context.aSnkCap[0][0];
    GMAPAPP_Context.aSnkPACRecord[0].Cap.SpecificCapLength = 16u;

    /* metadata in Audio Codec Configuration*/
    GMAPAPP_Context.aSnkPACRecord[0].Cap.MetadataLength = 0x04;
    GMAPAPP_Context.aSnkMetadata[0][0] = METADATA_PREFERRED_AUDIO_CONTEXTS_LENGTH;
    GMAPAPP_Context.aSnkMetadata[0][1] = METADATA_PREFERRED_AUDIO_CONTEXTS;
    GMAPAPP_Context.aSnkMetadata[0][2] = (uint8_t) (preferred_audio_context);
    GMAPAPP_Context.aSnkMetadata[0][3] = (uint8_t) (preferred_audio_context >> 8 );
    GMAPAPP_Context.aSnkPACRecord[0].Cap.pMetadata = &GMAPAPP_Context.aSnkMetadata[0][0];
    status = CAP_RegisterSnkPACRecord(&GMAPAPP_Context.aSnkPACRecord[0],&GMAPAPP_Context.aSnkPACRecordHandle[0]);
    if (status == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Successfully registered Sink PAC record id %d\n",0);
    }
    else
    {
      LOG_INFO_APP("Failed to register Sink PAC record id %d\n",0);
      return status;
    }
#endif /* (APP_NUM_SNK_PAC_RECORDS > 0u) */

#if (APP_NUM_SNK_ASE >= 1)
#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 0u)
#if (APP_NUM_SNK_ASE == 1 && APP_MAX_CHANNEL_PER_SNK_ASE == 1)
    audio_locations = MONO_AUDIO_LOCATIONS;
#else /* (APP_NUM_SNK_ASE == 1 && APP_MAX_CHANNEL_PER_SNK_ASE == 1) */
    audio_locations = STEREO_AUDIO_LOCATIONS;
#endif /* (APP_NUM_SNK_ASE == 1 && APP_MAX_CHANNEL_PER_SNK_ASE == 1) */
#else /*(APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u) */
    if (csip_config_id == 0)
    {
#if (APP_NUM_SNK_ASE == 1 && APP_MAX_CHANNEL_PER_SNK_ASE == 1)
      audio_locations = MONO_AUDIO_LOCATIONS;
#else /* (APP_NUM_SNK_ASE == 1 && APP_MAX_CHANNEL_PER_SNK_ASE == 1) */
      audio_locations = STEREO_AUDIO_LOCATIONS;
#endif /* (APP_NUM_SNK_ASE == 1 && APP_MAX_CHANNEL_PER_SNK_ASE == 1) */
    }
    else
    {
      audio_locations = (1u << (csip_config_id - 1u));
    }
#endif /*(APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 0u) */
    /*
     * Set the supported Audio Locations, which will be exposed
     * to remote device for reception of audio data
     */
    status = CAP_SetSnkAudioLocations(audio_locations);
    if (status == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Successfully set the Supported Sink Audio Locations 0x%08X\n",audio_locations);
      GMAPAPP_Context.SnkAudioLocations = audio_locations;
    }
    else
    {
      LOG_INFO_APP("Failed to set the Supported Sink Audio Locations\n");
      return status;
    }
#endif /*(APP_NUM_SNK_ASE >= 1)*/
  }

  if (audio_role & AUDIO_ROLE_SOURCE)
  {
#if (APP_NUM_SRC_PAC_RECORDS > 0u)
    /* Register the Source Codec Capabilities */
    /*Set Codec ID configuration*/
    GMAPAPP_Context.aSrcPACRecord[0].Cap.CodecID.CodingFormat = AUDIO_CODING_FORMAT_LC3;
    GMAPAPP_Context.aSrcPACRecord[0].Cap.CodecID.CompanyID = COMPANY_ID;
    GMAPAPP_Context.aSrcPACRecord[0].Cap.CodecID.VsCodecID = 0x0000;

    /* Set supported codec capabilities configuration */
    GMAPAPP_Context.aSrcCap[0][0] = 0x03;
    GMAPAPP_Context.aSrcCap[0][1] = CODEC_CAP_SAMPLING_FREQ;
    for (uint8_t i = 0; i < num_src_capabilities ;i++)
    {
      GMAPAPP_Context.aSrcCap[0][2] |= (uint8_t) (APP_CodecSpecificCap[a_src_cap_id[i]].Freq);
      GMAPAPP_Context.aSrcCap[0][3] |= (uint8_t) ((APP_CodecSpecificCap[a_src_cap_id[i]].Freq >> 8 ));
    }

    GMAPAPP_Context.aSrcCap[0][4] = 0x02;
    GMAPAPP_Context.aSrcCap[0][5] = CODEC_CAP_FRAME_DURATION;
    for (uint8_t i = 0; i < num_src_capabilities ;i++)
    {
      GMAPAPP_Context.aSrcCap[0][6] |= APP_CodecSpecificCap[a_src_cap_id[i]].FrameDuration;
    }

    GMAPAPP_Context.aSrcCap[0][7] = 0x05;
    GMAPAPP_Context.aSrcCap[0][8] = CODEC_CAP_OCTETS_PER_CODEC_FRAME;
    for (uint8_t i = 0; i < num_src_capabilities ;i++)
    {
      uint32_t min_octet_per_codec_frame = APP_CodecSpecificCap[a_src_cap_id[i]].MinOctetsPerCodecFrame;
      uint32_t max_octet_per_codec_frame = APP_CodecSpecificCap[a_src_cap_id[i]].MaxOctetsPerCodecFrame;

      if (i > 0)
      {
        min_octet_per_codec_frame = MIN(min_octet_per_codec_frame,
                                        GMAPAPP_Context.aSrcCap[0][9] + (GMAPAPP_Context.aSrcCap[0][10] << 8));
        max_octet_per_codec_frame = MAX(max_octet_per_codec_frame,
                                        GMAPAPP_Context.aSrcCap[0][11] + (GMAPAPP_Context.aSrcCap[0][12] << 8));
      }

      GMAPAPP_Context.aSrcCap[0][9] = (uint8_t) (min_octet_per_codec_frame);
      GMAPAPP_Context.aSrcCap[0][10] = (uint8_t) (min_octet_per_codec_frame >> 8 );
      GMAPAPP_Context.aSrcCap[0][11] = (uint8_t) (max_octet_per_codec_frame);
      GMAPAPP_Context.aSrcCap[0][12] = (uint8_t) (max_octet_per_codec_frame >> 8);
    }

    GMAPAPP_Context.aSrcCap[0][13] = 0x02;
    GMAPAPP_Context.aSrcCap[0][14] = CODEC_CAP_AUDIO_CHNL_COUNTS;
    GMAPAPP_Context.aSrcCap[0][15] = (APP_MAX_CHANNEL_PER_SRC_ASE | SUPPORTED_AUDIO_CHNL_COUNT_1);

    GMAPAPP_Context.aSrcPACRecord[0].Cap.pSpecificCap = &GMAPAPP_Context.aSrcCap[0][0];
    GMAPAPP_Context.aSrcPACRecord[0].Cap.SpecificCapLength = 16u;

    /* metadata in Audio Codec Configuration*/
    GMAPAPP_Context.aSrcPACRecord[0].Cap.MetadataLength = 0x04;
    GMAPAPP_Context.aSrcMetadata[0][0] = METADATA_PREFERRED_AUDIO_CONTEXTS_LENGTH;
    GMAPAPP_Context.aSrcMetadata[0][1] = METADATA_PREFERRED_AUDIO_CONTEXTS;
    GMAPAPP_Context.aSrcMetadata[0][2] = (uint8_t) (AUDIO_CONTEXT_CONVERSATIONAL);
    GMAPAPP_Context.aSrcMetadata[0][3] = (uint8_t) (AUDIO_CONTEXT_CONVERSATIONAL >> 8 );
    GMAPAPP_Context.aSrcPACRecord[0].Cap.pMetadata = &GMAPAPP_Context.aSrcMetadata[0][0];

