STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
    status = CAP_RegisterSrcPACRecord(&GMAPAPP_Context.aSrcPACRecord[0],&GMAPAPP_Context.aSrcPACRecordHandle[0]);
    if (status == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Successfully registered Source PAC record id %d\n",0);
    }
    else
    {
      LOG_INFO_APP("Failed to register Source PAC record id %d\n",0);
      return status;
    }
#endif /*(APP_NUM_SRC_PAC_RECORDS > 0u)*/
#if (APP_NUM_SRC_ASE >= 1)
#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 0u)
#if (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1)
    audio_locations = MONO_AUDIO_LOCATIONS;
#else /* (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1) */
    audio_locations = STEREO_AUDIO_LOCATIONS;
#endif /* (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1) */
#else /*(APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u) */
    if (csip_config_id == 0)
    {
#if (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1)
        audio_locations = MONO_AUDIO_LOCATIONS;
#else /* (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1) */
        audio_locations = STEREO_AUDIO_LOCATIONS;
#endif /* (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1) */
    }
    else
    {
      audio_locations =  (1u << (csip_config_id - 1u));
    }
#endif /*(APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 0u) */
    /*
     * Set the supported Audio Locations, which will be exposed
     * to remote device for reception of audio data
     */
    status = CAP_SetSrcAudioLocations(audio_locations);
    if (status == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Successfully set the Supported Source Audio Locations 0x%08X\n",audio_locations);
      GMAPAPP_Context.SrcAudioLocations = audio_locations;
    }
    else
    {
      LOG_INFO_APP("Failed to set the Supported Source Audio Locations\n");
      return status;
    }
  }
#endif  /* (APP_NUM_SRC_ASE >= 1) */

  /* Set supported audio context for reception and transmission */
  status = CAP_SetSupportedAudioContexts(supported_snk_context, supported_src_context);
  if (status == BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Successfully set the Supported Audio Contexts:\n");
    LOG_INFO_APP("Snk Audio Contexts : 0x%04X\n",supported_snk_context);
    LOG_INFO_APP("Src Audio Contexts : 0x%04X\n",supported_src_context);
    GMAPAPP_Context.SupportedSnkAudioContext = supported_snk_context;
    GMAPAPP_Context.SupportedSrcAudioContext = supported_src_context;
  }
  else
  {
    LOG_INFO_APP("Failed to set the Supported Audio Contexts\n");
    return status;
  }

  /* Set Available audio context for reception and transmission */
  status = CAP_SetAvailableAudioContexts(available_snk_context, available_src_context);
  if (status == BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Successfully set the Available Audio Contexts\n");
    LOG_INFO_APP("Snk Audio Contexts : 0x%04X\n",available_snk_context);
    LOG_INFO_APP("Src Audio Contexts : 0x%04X\n",available_src_context);
    GMAPAPP_Context.AvailableSnkAudioContext = available_snk_context;
    GMAPAPP_Context.AvailableSrcAudioContext = available_src_context;
  }
  else
  {
    LOG_INFO_APP("Failed to set the Available Audio Contexts\n");
    return status;
  }
  /* Register the Audio Stream Endpoints*/
  status = CAP_RegisterAudioChannels(APP_NUM_SNK_ASE,
                                     APP_NUM_SRC_ASE);
  if (status == BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Successfully register %ld Sink Audio Stream Endpoints\n", APP_NUM_SNK_ASE);
    LOG_INFO_APP("Successfully register %ld Source Audio Stream Endpoints\n", APP_NUM_SRC_ASE);
    GMAPAPP_Context.NumSnkASEs = APP_NUM_SNK_ASE;
    GMAPAPP_Context.NumSrcASEs = APP_NUM_SRC_ASE;
  }
  else
  {
    LOG_INFO_APP("Failed to register Audio Channels\n");
    return status;
  }

#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
  if (GMAPAPP_Context.SnkAudioLocations == 0)
  {
  /*Configure Audio Location for Broadcast Sink */
#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 0u)
    audio_locations = STEREO_AUDIO_LOCATIONS;
#else /*(APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u) */
    if (csip_config_id == 0)
    {
      audio_locations = STEREO_AUDIO_LOCATIONS;
    }
    else
    {
      audio_locations = (1u << (csip_config_id - 1u));
    }
#endif /*(APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 0u) */
    status = CAP_SetSnkAudioLocations(audio_locations);
    if (status == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Successfully set the Supported Sink Audio Locations 0x%08X\n",audio_locations);
      GMAPAPP_Context.BSNK.Audio_Location = audio_locations;
    }
    else
    {
      LOG_INFO_APP("Failed to set the Supported Sink Audio Locations\n");
      return status;
    }
  }
  else
  {
    GMAPAPP_Context.BSNK.Audio_Location = GMAPAPP_Context.SnkAudioLocations;
  }
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER) */
  return status;
}

static tBleStatus GMAPAPP_GMAPInit(GMAP_Role_t Role)
{
  uint8_t status;
  uint8_t i;
#if (APP_NUM_SNK_PAC_RECORDS > 0)
  uint8_t snk_record_i = MIN_NUM_BAP_SNK_PAC_RECORDS;
#endif /*(APP_NUM_SNK_PAC_RECORDS > 0)*/
#if (APP_NUM_SRC_PAC_RECORDS > 0)
  uint8_t src_record_i = MIN_NUM_BAP_SRC_PAC_RECORDS;
#endif /*(APP_NUM_SRC_PAC_RECORDS > 0)*/
  uint8_t ret = BLE_STATUS_SUCCESS;
  uint8_t num_gmap_src_pac = 0;
  uint8_t num_gmap_snk_pac = 0;
  uint8_t a_ugt_src_pac_id[MIN_NUM_GMAP_SRC_CODEC_CAP];
  uint8_t a_ugt_snk_pac_id[MIN_NUM_GMAP_SNK_CODEC_CAP];
  status = USECASE_DEV_MGMT_Init();

  if (status == BLE_STATUS_SUCCESS)
  {
    if ((APP_GMAP_ROLE & GMAP_ROLE_UNICAST_GAME_TERMINAL) != 0)
    {
      if ((APP_GMAP_UGT_FEATURE & UGT_FEATURES_SOURCE_SUPPORT) != 0)
      {
        a_ugt_src_pac_id[num_gmap_src_pac++] = LC3_16_1;
        a_ugt_src_pac_id[num_gmap_src_pac++] = LC3_16_2;
        a_ugt_src_pac_id[num_gmap_src_pac++] = LC3_32_1;
        a_ugt_src_pac_id[num_gmap_src_pac++] = LC3_32_2;
      }

      if ((APP_GMAP_UGT_FEATURE & UGT_FEATURES_80_KBPS_SOURCE_SUPPORT) != 0)
      {
        a_ugt_src_pac_id[num_gmap_src_pac++] = LC3_48_1;
        a_ugt_src_pac_id[num_gmap_src_pac++] = LC3_48_2;
      }

      if ((APP_GMAP_UGT_FEATURE & UGT_FEATURES_64_KBPSSINK_SUPPORT) != 0)
      {
        a_ugt_snk_pac_id[num_gmap_snk_pac++] = LC3_32_1;
        a_ugt_snk_pac_id[num_gmap_snk_pac++] = LC3_32_2;
      }
    }

    if (((APP_GMAP_ROLE & GMAP_ROLE_UNICAST_GAME_TERMINAL) != 0
        && (APP_GMAP_UGT_FEATURE & UGT_FEATURES_SINK_SUPPORT) != 0)
        || (APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) != 0)
    {
        a_ugt_snk_pac_id[num_gmap_snk_pac++] = LC3_48_1;
        a_ugt_snk_pac_id[num_gmap_snk_pac++] = LC3_48_2;
        a_ugt_snk_pac_id[num_gmap_snk_pac++] = LC3_48_3;
        a_ugt_snk_pac_id[num_gmap_snk_pac++] = LC3_48_4;
    }
#if (APP_NUM_SNK_PAC_RECORDS > 0u)
    if (num_gmap_snk_pac > 0)
    {
      /* Register the Sink Codec Capabilities */

