STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
      /*Set Codec ID configuration*/
      GMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.CodecID.CodingFormat = AUDIO_CODING_FORMAT_LC3;
      GMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.CodecID.CompanyID = COMPANY_ID;
      GMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.CodecID.VsCodecID = 0x0000;

      /* Set supported codec capabilities configuration */
      GMAPAPP_Context.aSnkCap[snk_record_i][0] = 0x03;
      GMAPAPP_Context.aSnkCap[snk_record_i][1] = CODEC_CAP_SAMPLING_FREQ;

      for (i = 0; i < num_gmap_snk_pac; i++)
      {
        GMAPAPP_Context.aSnkCap[snk_record_i][2] |= (uint8_t) (APP_CodecSpecificCap[a_ugt_snk_pac_id[i]].Freq);
        GMAPAPP_Context.aSnkCap[snk_record_i][3] |= (uint8_t) ((APP_CodecSpecificCap[a_ugt_snk_pac_id[i]].Freq >> 8 ));
      }

      GMAPAPP_Context.aSnkCap[snk_record_i][4] = 0x02;
      GMAPAPP_Context.aSnkCap[snk_record_i][5] = CODEC_CAP_FRAME_DURATION;

      for (i = 0; i < num_gmap_snk_pac; i++)
      {
        GMAPAPP_Context.aSnkCap[snk_record_i][6] |= APP_CodecSpecificCap[a_ugt_snk_pac_id[i]].FrameDuration;
      }

      GMAPAPP_Context.aSnkCap[snk_record_i][7] = 0x05;
      GMAPAPP_Context.aSnkCap[snk_record_i][8] = CODEC_CAP_OCTETS_PER_CODEC_FRAME;

      for (i = 0; i < num_gmap_snk_pac; i++)
      {
        uint32_t min_octet_per_codec_frame = APP_CodecSpecificCap[a_ugt_snk_pac_id[i]].MinOctetsPerCodecFrame;
        uint32_t max_octet_per_codec_frame = APP_CodecSpecificCap[a_ugt_snk_pac_id[i]].MaxOctetsPerCodecFrame;

        if (i > 0)
        {
          min_octet_per_codec_frame = MIN(min_octet_per_codec_frame,
                                          GMAPAPP_Context.aSnkCap[snk_record_i][9] + (GMAPAPP_Context.aSnkCap[snk_record_i][10] << 8));
          max_octet_per_codec_frame = MAX(max_octet_per_codec_frame,
                                          GMAPAPP_Context.aSnkCap[snk_record_i][11] + (GMAPAPP_Context.aSnkCap[snk_record_i][12] << 8));
        }

        GMAPAPP_Context.aSnkCap[snk_record_i][9] = (uint8_t) (min_octet_per_codec_frame);
        GMAPAPP_Context.aSnkCap[snk_record_i][10] = (uint8_t) (min_octet_per_codec_frame >> 8 );
        GMAPAPP_Context.aSnkCap[snk_record_i][11] = (uint8_t) (max_octet_per_codec_frame);
        GMAPAPP_Context.aSnkCap[snk_record_i][12] = (uint8_t) (max_octet_per_codec_frame >> 8);
      }

      GMAPAPP_Context.aSnkCap[snk_record_i][13] = 0x02;
      GMAPAPP_Context.aSnkCap[snk_record_i][14] = CODEC_CAP_AUDIO_CHNL_COUNTS;
      GMAPAPP_Context.aSnkCap[snk_record_i][15] = (APP_MAX_CHANNEL_PER_SRC_ASE | SUPPORTED_AUDIO_CHNL_COUNT_1);

      GMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.pSpecificCap = &GMAPAPP_Context.aSnkCap[snk_record_i][0];
      GMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.SpecificCapLength = 16u;

      /* metadata in Audio Codec Configuration*/
      GMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.MetadataLength = 0x00;

      GMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.pMetadata = &GMAPAPP_Context.aSnkMetadata[snk_record_i][0];

      ret = CAP_RegisterSnkPACRecord(&GMAPAPP_Context.aSnkPACRecord[snk_record_i],
                                     &GMAPAPP_Context.aSnkPACRecordHandle[snk_record_i]);
      if (ret == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("Successfully registered Sink PAC Record id %d\n",snk_record_i);
        snk_record_i++;
      }
      else
      {
        LOG_INFO_APP("Failed to register Sink PAC Record id %d\n",snk_record_i);
        return ret;
      }
    }
#endif /* (APP_NUM_SNK_PAC_RECORDS > 0u)*/

#if (APP_NUM_SRC_PAC_RECORDS > 0u)
    if (num_gmap_src_pac > 0)
    {
      /* Register the Source Codec Capabilities */
      /*Set Codec ID configuration*/
      GMAPAPP_Context.aSrcPACRecord[src_record_i].Cap.CodecID.CodingFormat = AUDIO_CODING_FORMAT_LC3;
      GMAPAPP_Context.aSrcPACRecord[src_record_i].Cap.CodecID.CompanyID = COMPANY_ID;
      GMAPAPP_Context.aSrcPACRecord[src_record_i].Cap.CodecID.VsCodecID = 0x0000;

      /* Set supported codec capabilities configuration */
      GMAPAPP_Context.aSrcCap[src_record_i][0] = 0x03;
      GMAPAPP_Context.aSrcCap[src_record_i][1] = CODEC_CAP_SAMPLING_FREQ;

      for (i = 0; i < num_gmap_src_pac ;i++)
      {
        GMAPAPP_Context.aSrcCap[src_record_i][2] |= (uint8_t) (APP_CodecSpecificCap[a_ugt_src_pac_id[i]].Freq);
        GMAPAPP_Context.aSrcCap[src_record_i][3] |= (uint8_t) ((APP_CodecSpecificCap[a_ugt_src_pac_id[i]].Freq >> 8 ));
      }

      GMAPAPP_Context.aSrcCap[src_record_i][4] = 0x02;
      GMAPAPP_Context.aSrcCap[src_record_i][5] = CODEC_CAP_FRAME_DURATION;

      for (i = 0; i < num_gmap_src_pac ;i++)
      {
        GMAPAPP_Context.aSrcCap[src_record_i][6] |= APP_CodecSpecificCap[a_ugt_src_pac_id[i]].FrameDuration;
      }

      GMAPAPP_Context.aSrcCap[src_record_i][7] = 0x05;
      GMAPAPP_Context.aSrcCap[src_record_i][8] = CODEC_CAP_OCTETS_PER_CODEC_FRAME;

      for (i = 0; i < num_gmap_src_pac ;i++)
      {
        uint32_t min_octet_per_codec_frame = APP_CodecSpecificCap[a_ugt_snk_pac_id[i]].MinOctetsPerCodecFrame;
        uint32_t max_octet_per_codec_frame = APP_CodecSpecificCap[a_ugt_snk_pac_id[i]].MaxOctetsPerCodecFrame;

        if (i > 0)
        {
          min_octet_per_codec_frame = MIN(min_octet_per_codec_frame,
                                          GMAPAPP_Context.aSrcCap[src_record_i][9] + (GMAPAPP_Context.aSrcCap[src_record_i][10] << 8));
          max_octet_per_codec_frame = MAX(max_octet_per_codec_frame,
                                          GMAPAPP_Context.aSrcCap[src_record_i][11] + (GMAPAPP_Context.aSrcCap[src_record_i][12] << 8));
        }

        GMAPAPP_Context.aSrcCap[src_record_i][9] = (uint8_t) (min_octet_per_codec_frame);
        GMAPAPP_Context.aSrcCap[src_record_i][10] = (uint8_t) (min_octet_per_codec_frame >> 8 );
        GMAPAPP_Context.aSrcCap[src_record_i][11] = (uint8_t) (max_octet_per_codec_frame);
        GMAPAPP_Context.aSrcCap[src_record_i][12] = (uint8_t) (max_octet_per_codec_frame >> 8);
      }

