STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
        if (info->CIS_ConnHandle != 0xFFFF)
        {
          for (i = 0; i< APP_MAX_NUM_CIS; i++)
          {
            if (GMAPAPP_Context.cis_snk_handle[i] == info->CIS_ConnHandle)
            {
              GMAPAPP_Context.cis_snk_handle[i] = 0xFFFFu;
              GMAPAPP_Context.num_cis_snk--;
              break;
            }
          }
        }
        if (GMAPAPP_Context.num_cis_snk == 0u)
        {
          LOG_INFO_APP("No more Output Audio Data Path is up\n");
          GMAPAPP_Context.audio_role_setup &= ~AUDIO_ROLE_SINK;
          LOG_INFO_APP("Stop Tx Audio Peripheral Driver\n");
          Stop_TxAudio();
        }
      }
      break;
    }
    case CAP_VCP_META_EVT:
    {
      VCP_Notification_Evt_t *p_vcp_evt = (VCP_Notification_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Volume Control Meta Event 0x%02X is received on ConnHandle 0x%04X:\n",
                  p_vcp_evt->EvtOpcode,
                  p_vcp_evt->ConnHandle);
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
      VCP_MetaEvt_Notification(p_vcp_evt);
#endif /*(APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
      break;
    }

    case CAP_MICP_META_EVT:
    {
      MICP_Notification_Evt_t *p_micp_evt = (MICP_Notification_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Microphone Control Meta Event 0x%02X is received on ConnHandle 0x%04X:\n",
                  p_micp_evt->EvtOpcode,
                  p_micp_evt->ConnHandle);
#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1u)
      MICP_MetaEvt_Notification(p_micp_evt);
#endif /*(APP_MICP_ROLE_DEVICE_SUPPORT == 1u)*/
      break;
    }


#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)

    case CAP_BROADCAST_AUDIO_UP_EVT:
    {
      Sampling_Freq_t sampling_freq;
      char freq_text[8];
      LOG_INFO_APP(">>== CAP_BROADCAST_AUDIO_UP_EVT\n");

      sampling_freq = LTV_GetConfiguredSamplingFrequency(
          &GMAPAPP_Context.BSNK.base_group.pSubgroups[0].pCodecSpecificConf[0],
          GMAPAPP_Context.BSNK.base_group.pSubgroups[0].CodecSpecificConfLength);

      switch (sampling_freq)
      {
        case SAMPLE_FREQ_8000_HZ:
        {
          strcpy(&freq_text[0], "8KHz");
          break;
        }
        case SAMPLE_FREQ_16000_HZ:
        {
          strcpy(&freq_text[0], "16KHz");
          break;
        }
        case SAMPLE_FREQ_24000_HZ:
        {
          strcpy(&freq_text[0], "24KHz");
          break;
        }
        case SAMPLE_FREQ_32000_HZ:
        {
          strcpy(&freq_text[0], "32KHz");
          break;
        }
        case SAMPLE_FREQ_44100_HZ:
        {
          strcpy(&freq_text[0], "44.1KHz");
          break;
        }
        case SAMPLE_FREQ_48000_HZ:
        {
          strcpy(&freq_text[0], "48KHz");
          break;
        }
        default:
        {
          strcpy(&freq_text[0], "Unknown");
          break;
        }
      }
      Menu_SetBroadcastSyncedPage(freq_text);
    }
    break;
    case CAP_BROADCAST_AUDIO_DOWN_EVT:
    {
      uint8_t status;
      LOG_INFO_APP(">>== CAP_BROADCAST_AUDIO_DOWN_EVT\n");
      MX_AudioDeInit();

      if (GMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SCAN_DELEGATOR)
      {
        Menu_SetNoStreamPage();
      }
      else
      {
        Menu_SetBroadcastScanPage();

        if (GMAPAPP_Context.BSNK.PASyncState != APP_PA_SYNC_STATE_IDLE)
        {
          /* Stop Periodic Advertising Sync */
          status = CAP_Broadcast_StopPASync(GMAPAPP_Context.BSNK.PASyncHandle);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : CAP_Broadcast_StopPASync() function, result: 0x%02X\n", status);
          }
          else
          {
            LOG_INFO_APP("  Success: CAP_Broadcast_StopPASync() function\n");
            GMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_IDLE;
          }
        }

        if (GMAPAPP_Context.BSNK.ScanState == APP_SCAN_STATE_IDLE)
        {
          /* Start Scan */
          status = CAP_Broadcast_StartAdvReportParsing();
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : CAP_Broadcast_StartAdvReportParsing() function, result: 0x%02X\n", status);
          }
          else
          {
            LOG_INFO_APP("  Success: CAP_Broadcast_StartAdvReportParsing() function\n");
          }

          if (status == BLE_STATUS_SUCCESS)
          {
            Scan_Param_Phy_t scan_param_phy;
            scan_param_phy.Scan_Type     = 0x00; /*Passive scanning*/
            scan_param_phy.Scan_Interval = SCAN_INTERVAL;
            scan_param_phy.Scan_Window   = SCAN_WINDOW;
            /* Starts an Observation procedure */
            status = aci_gap_ext_start_scan( 0x00,
                                            GAP_OBSERVATION_PROC,
                                            0x00,                         /* Address type: Public */
                                            0x00,                         /* Filter duplicates: No */
                                            0x00,                         /* Scan continuously until explicitly disable */
                                            0x00,                         /* Scan continuously */
                                            0x00,                         /* Filter policy: Accept all */
                                            HCI_SCANNING_PHYS_LE_1M,
                                            &scan_param_phy);
            if (status != BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Fail   : aci_gap_ext_start_scan() function with Scan procedure 0x%02X, result: 0x%02X\n",
                           GAP_OBSERVATION_PROC,
                           status);
            }
            else
            {
              LOG_INFO_APP("  Success: aci_gap_ext_start_scan() function with Scan procedure 0x%02X\n",
                           GAP_OBSERVATION_PROC);
              GMAPAPP_Context.BSNK.ScanState = APP_SCAN_STATE_SCANNING;
            }
          }
        }
      }
    }
    break;

    case CAP_BROADCAST_SOURCE_ADV_REPORT_EVT:
    {
      BAP_Broadcast_Source_Adv_Report_Data_t *data = (BAP_Broadcast_Source_Adv_Report_Data_t*) pNotification->pInfo;
      LOG_INFO_APP(">>== CAP_BROADCAST_SOURCE_ADV_REPORT_EVT\n");
      LOG_INFO_APP("     - Broadcasting Device with address %02X:%02X:%02X:%02X:%02X:%02X\n",
                  data->pAdvAddress[5],
                  data->pAdvAddress[4],
                  data->pAdvAddress[3],
                  data->pAdvAddress[2],
                  data->pAdvAddress[1],
                  data->pAdvAddress[0]);
      if(GMAPAPP_Context.BSNK.PASyncState == APP_PA_SYNC_STATE_IDLE
         && GMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE)
      {
        uint8_t parse_index = 0;
        char name[30] = "Unknown";
        char bid[12] = "ID:0x\0";
        const uint8_t* name_ptr = 0;
        uint8_t name_len = 0;

        while (parse_index + 3 < data->AdvertisingDataLength)
        {
          /* First priority to the Broadcast Name */
          if (data->pAdvertisingData[parse_index + 1] == 0x30)
          {
            name_ptr = &data->pAdvertisingData[parse_index + 2];
            name_len = MIN(data->pAdvertisingData[parse_index] - 1, 29);
            break;
          }
          /* Second priority to the Complete Local Name */
          else if (data->pAdvertisingData[parse_index + 1] == AD_TYPE_COMPLETE_LOCAL_NAME)
          {
            name_ptr = &data->pAdvertisingData[parse_index + 2];
            name_len = MIN(data->pAdvertisingData[parse_index] - 1, 29);
          }
          /* Thrid priority to the Broadcast ID */
          else if (data->pAdvertisingData[parse_index + 1] == AD_TYPE_SERVICE_DATA &&
              data->pAdvertisingData[parse_index + 2] == 0x52 &&
              data->pAdvertisingData[parse_index + 3] == 0x18)
          {
            sprintf(&bid[5],"%X", data->pAdvertisingData[parse_index + 6]);
            sprintf(&bid[7],"%X", data->pAdvertisingData[parse_index + 5]);
            sprintf(&bid[9],"%X",data->pAdvertisingData[parse_index + 4]);
          }
          parse_index += data->pAdvertisingData[parse_index] + 1;
        }
        if (name_ptr != 0)
        {
          UTIL_MEM_cpy_8(&name[0], name_ptr, name_len);
          name[name_len] = '\0';
        }
        else if (bid[5] != '\0')
        {
          UTIL_MEM_cpy_8(&name[0], bid, 11);
          name[11] = '\0';
        }

#if (CFG_TEST_VALIDATION == 1u)
        if (memcmp(&name[0], "GMAP_WBA", 8u) != 0)
        {
          return;
        }
#endif /*(CFG_TEST_VALIDATION == 1u)*/

        Menu_AddBroadcastSource(data->AdvSID, (uint8_t *) &data->pAdvAddress[0],
                                data->AdvAddressType, &name[0]);
      }
    }
    break;

    case CAP_BROADCAST_PA_SYNC_ESTABLISHED_EVT:
    {
      tBleStatus ret;
      LOG_INFO_APP(">>== CAP_BROADCAST_PA_SYNC_ESTABLISHED_EVT\n");
      BAP_PA_Sync_Established_Data_t *data = (BAP_PA_Sync_Established_Data_t*) pNotification->pInfo;
      LOG_INFO_APP("     - SyncHandle : 0x%02x\n",data->SyncHandle);
      GMAPAPP_Context.BSNK.PASyncHandle = data->SyncHandle;
      GMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_SYNCHRONIZED;

