STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
      ret = CAP_Broadcast_StopAdvReportParsing();
      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("  Fail   : CAP_Broadcast_StopAdvReportParsing() function, result: 0x%02X\n", ret);
      }
      else
      {
        LOG_INFO_APP("  Success: CAP_Broadcast_StopAdvReportParsing() function\n");
      }
      ret = aci_gap_terminate_gap_proc(GAP_OBSERVATION_PROC);
      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("  Fail   : aci_gap_terminate_gap_proc() function, result: 0x%02X\n", ret);
      }
      else
      {
        GMAPAPP_Context.BSNK.ScanState = APP_SCAN_STATE_IDLE;
        LOG_INFO_APP("  Success: aci_gap_terminate_gap_proc() function\n");
      }
    }
    break;

    case CAP_BROADCAST_PA_SYNC_LOST_EVT:
      LOG_INFO_APP(">>== CAP_BROADCAST_PA_SYNC_LOST_EVT\n");
      GMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_IDLE;
    break;

    case CAP_BROADCAST_BASE_REPORT_EVT:
      {
        LOG_INFO_APP(">>== CAP_BROADCAST_BASE_REPORT_EVT\n");

        if (GMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE)
        {
          BAP_BASE_Report_Data_t *base_data;
          uint8_t status;
          uint8_t index = 0;
          uint8_t i;
          uint8_t j;
          uint8_t k;
          uint8_t l;

          base_data = (BAP_BASE_Report_Data_t*) pNotification->pInfo;

          status = CAP_Broadcast_ParseBASEGroup(base_data->pBasePayload,
                                                base_data->BasePayloadLength,
                                                &(GMAPAPP_Context.BSNK.base_group),
                                                &(index));

          GMAPAPP_Context.BSNK.base_group.pSubgroups = &(GMAPAPP_Context.BSNK.base_subgroups[0]);
          GMAPAPP_Context.BSNK.base_subgroups[0].pCodecSpecificConf = &(GMAPAPP_Context.BSNK.codec_specific_config_subgroup[0][0]);
          GMAPAPP_Context.BSNK.base_subgroups[0].pMetadata = &(GMAPAPP_Context.BSNK.subgroup_metadata[0][0]);
          GMAPAPP_Context.BSNK.base_subgroups[1].pCodecSpecificConf = &(GMAPAPP_Context.BSNK.codec_specific_config_subgroup[1][0]);
          GMAPAPP_Context.BSNK.base_subgroups[1].pMetadata = &(GMAPAPP_Context.BSNK.subgroup_metadata[1][0]);


          GMAPAPP_Context.BSNK.base_bis[0].pCodecSpecificConf = &(GMAPAPP_Context.BSNK.codec_specific_config_bis[0][0]);
          GMAPAPP_Context.BSNK.base_bis[1].pCodecSpecificConf = &(GMAPAPP_Context.BSNK.codec_specific_config_bis[1][0]);

          if(status == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> Start BAP BSNK Parse BASE Group INFO\n");
            LOG_INFO_APP("   Payload Len role : 0x%02x\n",base_data->BasePayloadLength);
            LOG_INFO_APP("   Presentation_delay: 0x%08x\n",GMAPAPP_Context.BSNK.base_group.PresentationDelay);
            LOG_INFO_APP("   Num_subgroups : 0x%02x\n",GMAPAPP_Context.BSNK.base_group.NumSubgroups);
            base_data->pBasePayload += index;
            base_data->BasePayloadLength -= index;

            if(GMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE)
            {
              GMAPAPP_Context.BSNK.num_sync_bis = 0;
            }

            /* Parse Subgroups */
            for (i = 0; i < GMAPAPP_Context.BSNK.base_group.NumSubgroups && status == BLE_STATUS_SUCCESS; i++)
            {
              status = CAP_Broadcast_ParseBASESubgroup(base_data->pBasePayload,
                                                       base_data->BasePayloadLength,
                                                       &(GMAPAPP_Context.BSNK.base_subgroups[i]),
                                                       &(index));
              base_data->pBasePayload += index;
              base_data->BasePayloadLength -= index;

              GMAPAPP_Context.BSNK.base_subgroups[i].pBIS = &(GMAPAPP_Context.BSNK.base_bis[i]);
              LOG_INFO_APP("    BAP_BSNK_ParseBASESubgroup INFO Number :%d\n", i);
              LOG_INFO_APP("    Codec ID : 0x%08x\n",GMAPAPP_Context.BSNK.base_subgroups[i].CodecID);
              LOG_INFO_APP("    Codec specific config length : %d bytes\n",
                          GMAPAPP_Context.BSNK.base_subgroups[i].CodecSpecificConfLength);
              if (GMAPAPP_Context.BSNK.base_subgroups[i].CodecSpecificConfLength > 0u)
              {
                for (k = 0;k<GMAPAPP_Context.BSNK.base_subgroups[i].CodecSpecificConfLength;k++)
                {
                  if (GMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k] > 0u)
                  {
                    LOG_INFO_APP("      Length: 0x%02x\n",GMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k]);
                    LOG_INFO_APP("        Type: 0x%02x\n",GMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k+1u]);
                    LOG_INFO_APP("        Value: 0x");
                    for (l = 0 ;l<(GMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k]-1);l++)
                    {
                      LOG_INFO_APP("%02x",GMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k+2u+l]);
                    }
                    LOG_INFO_APP("\n");
                  }
                  k+=GMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k];
                }
              }
              LOG_INFO_APP("    Metadata length : %d bytes\n",GMAPAPP_Context.BSNK.base_subgroups[i].MetadataLength);
              if (GMAPAPP_Context.BSNK.base_subgroups[i].MetadataLength > 0)
              {
                for (k = 0;k<GMAPAPP_Context.BSNK.base_subgroups[i].MetadataLength;k++)
                {
                  if (GMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k] > 0u)
                  {
                    LOG_INFO_APP("      Length: 0x%02x\n",GMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k]);
                    LOG_INFO_APP("        Type: 0x%02x\n",GMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k+1u]);
                    LOG_INFO_APP("        Value: 0x");
                    for (l = 0 ;l<(GMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k]-1);l++)
                    {
                      LOG_INFO_APP("%02x",GMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k+2u+l]);
                    }
                    LOG_INFO_APP("\n");
                  }
                  k+=GMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k];
                }
              }
              LOG_INFO_APP("    Num_BIS : %d\n",GMAPAPP_Context.BSNK.base_subgroups[i].NumBISes);

              /* Parse BIS */
              for (j = 0; (j < GMAPAPP_Context.BSNK.base_subgroups[i].NumBISes) && (status == BLE_STATUS_SUCCESS); j++)
              {
                status = CAP_Broadcast_ParseBASEBIS(base_data->pBasePayload,
                                                    base_data->BasePayloadLength,
                                                    &(GMAPAPP_Context.BSNK.base_bis[j]),
                                                    &(index));
                base_data->pBasePayload += index;
                base_data->BasePayloadLength -= index;
                LOG_INFO_APP("      BIS INDEX : 0x%02x\n",GMAPAPP_Context.BSNK.base_bis[j].BIS_Index);
                LOG_INFO_APP("      Codec specific config length : %d bytes\n",GMAPAPP_Context.BSNK.base_bis[j].CodecSpecificConfLength);

                Audio_Chnl_Allocation_t channel_alloc = 0x00000000;
                if (GMAPAPP_Context.BSNK.base_bis[j].CodecSpecificConfLength > 0u)
                {
                  for (int k = 0;k<GMAPAPP_Context.BSNK.base_bis[j].CodecSpecificConfLength;k++)
                  {
                    if (GMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k] > 0u)
                    {
                      LOG_INFO_APP("        Length: 0x%02x\n",GMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k]);
                      LOG_INFO_APP("          Type: 0x%02x\n",GMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k+1u]);
                      LOG_INFO_APP("          Value: 0x");
                      for (int l = 0 ;l<(GMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k]-1);l++)
                      {
                        LOG_INFO_APP("%02x",GMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k+2u+l]);
                      }
                      LOG_INFO_APP("\n");
                    }
                    k+=GMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k];
                  }
                  channel_alloc = LTV_GetConfiguredAudioChannelAllocation(GMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf,
                                                                          GMAPAPP_Context.BSNK.base_bis[j].CodecSpecificConfLength);
                }
                if (channel_alloc == 0x00000000)
                {
                  /* No channel alloc on BIS level, get channel alloc on subgroup level */
                  channel_alloc = LTV_GetConfiguredAudioChannelAllocation(GMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf,
                                                                          GMAPAPP_Context.BSNK.base_subgroups[i].CodecSpecificConfLength);
                }
                if(channel_alloc != 0x00000000)
                {
                  LOG_INFO_APP("      Audio Channels Allocation Configuration : 0x%08X\n",channel_alloc);
                  LOG_INFO_APP("      Number of Audio Channels %d \n",APP_GetBitsAudioChnlAllocations(channel_alloc));
                }
                if(GMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE)
                {
                  if (GMAPAPP_Context.BSNK.Audio_Location != 0x00000000)
                  {
                    /* check if the Channel allocation matches with the Sink Audio Location supported by the Broadcast Sink */
                    if(channel_alloc != 0x00000000)
                    {
                      if ((GMAPAPP_Context.BSNK.Audio_Location & channel_alloc) != 0x00000000)
                      {
                        GMAPAPP_Context.BSNK.sync_bis_index[GMAPAPP_Context.BSNK.num_sync_bis] = (j+1);
                        GMAPAPP_Context.BSNK.num_sync_bis++;
                      }
                    }
                    else
                    {
                      GMAPAPP_Context.BSNK.sync_bis_index[GMAPAPP_Context.BSNK.num_sync_bis] = (j+1);
                      GMAPAPP_Context.BSNK.num_sync_bis++;
                    }
                  }
                  else
                  {
                    GMAPAPP_Context.BSNK.sync_bis_index[GMAPAPP_Context.BSNK.num_sync_bis] = (j+1);
                    GMAPAPP_Context.BSNK.num_sync_bis++;
                  }
                }
              }
            }
            LOG_INFO_APP("==>> End Start BAP BSNK Parse BASE Group INFO\n");

