STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
            if(GMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE)
            {
              memcpy(&GMAPAPP_Context.BSNK.codec_specific_config_subgroup[0],
                     GMAPAPP_Context.BSNK.base_subgroups[0].pCodecSpecificConf,
                     GMAPAPP_Context.BSNK.base_subgroups[0].CodecSpecificConfLength);

              uint32_t freq = LTV_GetConfiguredSamplingFrequency(GMAPAPP_Context.BSNK.base_subgroups[0].pCodecSpecificConf,
                                                                 GMAPAPP_Context.BSNK.base_subgroups[0].CodecSpecificConfLength);

              LOG_INFO_APP("==>> Audio Clock with Sample Frequency Type 0x%02X Initialization\n",freq);
              AudioClock_Init(freq);
            }
          }
        }
      break;
      }

    case CAP_BROADCAST_BIGINFO_REPORT_EVT:
    {
      if (GMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE)
      {
        uint8_t status;
        BAP_BIGInfo_Report_Data_t *data = (BAP_BIGInfo_Report_Data_t *) pNotification->pInfo;
        //uint8_t bis_index[2u] = {0x01, 0x02};

        LOG_INFO_APP("  CAP_Broadcast_StartBIGSync() function for %d BIEses:\n", GMAPAPP_Context.BSNK.num_sync_bis);
        for (uint8_t i = 0u; i < GMAPAPP_Context.BSNK.num_sync_bis;i++)
        {
          LOG_INFO_APP("  BIS Index %d\n", GMAPAPP_Context.BSNK.sync_bis_index[i]);
        }
        status = CAP_Broadcast_StartBIGSync(BIG_HANDLE,
                                      data->SyncHandle,
                                      &(GMAPAPP_Context.BSNK.sync_bis_index[0]),
                                      GMAPAPP_Context.BSNK.num_sync_bis,
                                      &(GMAPAPP_Context.BSNK.base_group),
                                      0u,
                                      BAP_BROADCAST_ENCRYPTION,
                                      aAPP_BroadcastCode,
                                      BIG_MSE,
                                      BIG_SYNC_TIMEOUT);
        if (status != BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("  Fail   : CAP_Broadcast_StartBIGSync() function, result: 0x%02X\n", status);
        }
        else
        {
          LOG_INFO_APP("  Success: CAP_Broadcast_StartBIGSync() function\n");
          GMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_SYNCHRONIZING;
          Menu_SetBISSyncPage();
        }
      }
      break;
    }

    case CAP_BROADCAST_BIG_SYNC_ESTABLISHED_EVT:
      {
        tBleStatus ret;
        BAP_BIG_Sync_Established_Data_t *data = (BAP_BIG_Sync_Established_Data_t*) pNotification->pInfo;
        LOG_INFO_APP(">>== CAP_BROADCAST_BIG_SYNC_ESTABLISHED_EVT\n");
        LOG_INFO_APP("     - Status = 0x%02x\n",pNotification->Status);

        if (pNotification->Status == BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("     - BIG_Handle = 0x%02x\n",data->BIGHandle);
          LOG_INFO_APP("     - Num BISes = %d\n",data->NumBISes);

          UTIL_MEM_cpy_8(&(GMAPAPP_Context.BSNK.current_BIS_conn_handles[0]),
                         data->pConnHandle,
                         (data->NumBISes * sizeof(uint16_t)));
          GMAPAPP_Context.BSNK.current_num_bis = data->NumBISes;
          GMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_SYNCHRONIZED;

          if (GMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SINK_ONLY)
          {
            ret = CAP_Broadcast_StopPASync(GMAPAPP_Context.BSNK.PASyncHandle);
            if (ret != BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Fail   : CAP_Broadcast_StopPASync() function, result: 0x%02X\n", ret);
            }
            else
            {
              LOG_INFO_APP("  Success: CAP_Broadcast_StopPASync() function\n");
              GMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_IDLE;
            }

            Set_Volume(Volume);
          }
          APP_BroadcastSetupAudio(AUDIO_ROLE_SINK);
        }
        else
        {
          GMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_IDLE;

          if (GMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SCAN_DELEGATOR)
          {
            Menu_SetNoStreamPage();
          }
          else
          {
            Menu_SetBroadcastScanPage();
          }
        }
      }
      break;

    case CAP_BROADCAST_BIG_SYNC_LOST_EVT:
      {
        LOG_INFO_APP(">>== CAP_BROADCAST_BIG_SYNC_LOST_EVT\n");
        GMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_IDLE;
      }
      break;

    case CAP_BROADCAST_SDE_ADD_SOURCE_REQ_EVT:
    {
      LOG_INFO_APP(">>== CAP_BROADCAST_SDE_ADD_SOURCE_REQ_EVT\n");

      CAP_Broadcast_AcceptAddBroadcastSource();
      break;
    }

    case CAP_BROADCAST_SDE_MODIFY_SOURCE_REQ_EVT:
    {
      LOG_INFO_APP(">>== CAP_BROADCAST_SDE_MODIFY_SOURCE_REQ_EVT\n");

      CAP_Broadcast_AcceptModifyBroadcastSource();
      break;
    }

    case CAP_BROADCAST_SDE_PA_SYNC_TERMINATED_EVT:
    {
      LOG_INFO_APP(">>== CAP_BROADCAST_SDE_PA_SYNC_TERMINATED_EVT\n");
      GMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_IDLE;
      break;
    }

    case CAP_BROADCAST_SDE_BIG_SYNC_TERMINATED_EVT:
    {
      LOG_INFO_APP(">>== CAP_BROADCAST_SDE_BIG_SYNC_TERMINATED_EVT\n");
      GMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_IDLE;
      break;
    }

#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/
    default:
      break;
  }
}

#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
static uint8_t APP_BroadcastSetupAudio(Audio_Role_t role)
{
  Sampling_Freq_t sampling_freq;
  Frame_Duration_t frame_duration;
  uint8_t direction = DATA_PATH_INPUT;
  uint32_t controller_delay;
  uint32_t controller_delay_min = 0;
  uint32_t controller_delay_max = 0;
  uint8_t a_codec_id[5] = {0x00,0x00,0x00,0x00,0x00};
  tBleStatus ret;

  LOG_INFO_APP("==>> Start APP_BroadcastSetupAudio function\n");

  a_codec_id[0] = AUDIO_CODING_FORMAT_LC3;

  sampling_freq = LTV_GetConfiguredSamplingFrequency(
      &GMAPAPP_Context.BSNK.base_group.pSubgroups[0].pCodecSpecificConf[0],
      GMAPAPP_Context.BSNK.base_group.pSubgroups[0].CodecSpecificConfLength);

  frame_duration = LTV_GetConfiguredFrameDuration(
      &GMAPAPP_Context.BSNK.base_group.pSubgroups[0].pCodecSpecificConf[0],
      GMAPAPP_Context.BSNK.base_group.pSubgroups[0].CodecSpecificConfLength);

