STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
  if ((sampling_freq != 0) && (frame_duration != 0xFF))
  {
    GMAPAPP_Context.SinkDecimation = 1;
    APP_StartBroadcastAudio(role);
    MX_AudioInit(role,
                 sampling_freq,
                 frame_duration,
                 (uint8_t *)aSnkBuff,
                 NULL);

    /* AUDIO_ROLE_SINK */
    direction = DATA_PATH_OUTPUT;
    CAP_Broadcast_ReadSupportedControllerDelay(GMAPAPP_Context.BSNK.current_num_bis,
                                               DATA_PATH_OUTPUT,
                                               a_codec_id,
                                               &controller_delay_min,
                                               &controller_delay_max);

    /* choice of implementation : we try to use as much as possible the controller RAM for delaying before the application RAM*/
    controller_delay = GMAPAPP_Context.BSNK.base_group.PresentationDelay - APP_DELAY_SNK_MIN;

    /* check that we don't exceed the maximum value */
    if (controller_delay > controller_delay_max)
    {
      controller_delay = controller_delay_max;
      LOG_INFO_APP("Controller delay clipped to maximum value %d us\n", controller_delay);
    }
    else if (controller_delay < controller_delay_min)
    {
      controller_delay = controller_delay_min;
      LOG_INFO_APP("Controller delay clipped to minimum value %d us\n", controller_delay);
      LOG_INFO_APP("Warning, could not respect the presentation delay (too low)\n");
    }
    else
    {
      LOG_INFO_APP("Controller delay chosen to %d us\n", controller_delay);
    }

    /* compute the application delay */
    LOG_INFO_APP("Expecting application to respect the delay of %d us\n",
                (GMAPAPP_Context.BSNK.base_group.PresentationDelay - controller_delay));
    if ((GMAPAPP_Context.BSNK.base_group.PresentationDelay - controller_delay) > APP_DELAY_SNK_MAX)
    {
      LOG_INFO_APP("Warning, could not respect the presentation delay (too high)\n");
    }

    CODEC_DataPathParam_t param;
    /* sample coded on 16bits */
    param.SampleDepth = 16;

    /* SAI/I2C peripheral driver requests to set decimation to 2 (stereo buffer)*/
    param.Decimation = 2;

    ret = CAP_Broadcast_SetupAudioDataPath(GMAPAPP_Context.BSNK.current_num_bis,
                                            &GMAPAPP_Context.BSNK.current_BIS_conn_handles[0],
                                            direction,
                                            a_codec_id,
                                            controller_delay,
                                            DATA_PATH_CIRCULAR_BUF,
                                            CONFIGURE_DATA_PATH_CONFIG_LEN,
                                            (const uint8_t*) &param);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : CAP_Broadcast_SetupAudioDataPath() function, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: CAP_Broadcast_SetupAudioDataPath() function\n");
    }
  }
  else
  {
    LOG_INFO_APP("Sampling Frequency in LTV is invalid\n");
    ret = BLE_STATUS_FAILED;
  }
  LOG_INFO_APP("==>> End PBPAPP_BroadcastSetupAudio function\n");
  return ret;
}

static uint8_t APP_StartBroadcastAudio(Audio_Role_t role)
{
  if(role == AUDIO_ROLE_SOURCE)
  {
    CODEC_RegisterTriggerClbk(1,0,&start_audio_source);
  }
  else if (role == AUDIO_ROLE_SINK)
  {
    CODEC_RegisterTriggerClbk(1,1,&start_audio_sink);
  }
  return 0;
}
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/

static uint8_t GMAPAPP_BuildAdvDataPacket(uint8_t *pAdvData,
                                         uint8_t *AdvPacketLen,
                                         CAP_Announcement_t AnnouncementType,
                                         uint8_t EnableSolicitationRequest,
                                         uint16_t Appearance)
{
  *AdvPacketLen = GMAP_BuildAdvPacket(AnnouncementType,
                                      (void*)0u,
                                      0u,
                                      Appearance,
                                      &pAdvData[0],
                                      (CAP_ADV_DATA_LEN+GMAP_USR_ADV_DATA_LEN));

  if (*AdvPacketLen > 0u)
  {
    uint8_t i;
    LOG_INFO_APP("CAP Advertising Packet (Length : %d) :\n",(*AdvPacketLen));
    for (i = 0u; i < (*AdvPacketLen) ; i++)
    {
      LOG_INFO_APP("0x%02X ",pAdvData[i]);
    }
    LOG_INFO_APP("\n");
    return BLE_STATUS_SUCCESS;
  }
  else
  {
    LOG_INFO_APP("Error to build Advertising Packet by CAP\n");
    return BLE_STATUS_ERROR;
  }
}

static void APP_ParseMetadataParams(APP_ASE_Info_t *pASE,
                                    uint16_t ConnHandle,
                                    uint8_t const *pMetadata,
                                    uint8_t MetadataLength)
{
  uint8_t status;
  Audio_Context_t audio_context = 0x0000;
  Audio_Context_t snk_context = 0x0000;
  Audio_Context_t src_context = 0x0000;
  Audio_Context_t available_snk_context = 0x0000;
  Audio_Context_t available_src_context = 0x0000;
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(ConnHandle);
  LOG_INFO_APP("Parse Metadata of ASE ID 0x%02X (Type 0x%02X) in state 0x%02X on ConnHandle 0x%04X\n",
               pASE->ID,
               pASE->type,
               pASE->state,
               ConnHandle);
  if (p_conn != 0)
  {
    status = LTV_GetStreamingAudioContexts((uint8_t *)pMetadata,MetadataLength,&audio_context);
    if(status == 1u)
    {
      LOG_INFO_APP("ASE ID 0x%02X on ConnHandle 0x%04X is associated to a Streaming Audio Contexts 0x%04X\n",
                   pASE->ID,
                   ConnHandle,
                   audio_context);
      /*update available audio contexts in case of streaming audio contexts associated to the ASE has changed*/
      if (pASE->streaming_audio_context != audio_context)
      {
        LOG_INFO_APP("ASE ID 0x%02X on ConnHandle 0x%04X was previously associated to a Streaming Audio Contexts 0x%04X\n",
                   pASE->ID,
                   ConnHandle,
                   pASE->streaming_audio_context);
        /* Release the Streaming Audio Contexts previously associated to the ASE to calculate resulting
         * new available audio contexts in compliance with other ASEs in ENABLING or STREAMING state
         */
        if (pASE->type == ASE_SINK)
        {
          if ( pASE->streaming_audio_context != 0x0000u)
          {
            snk_context = APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                                pASE,
                                                                pASE->streaming_audio_context);
          }
        }
        else
        {
          if ( pASE->streaming_audio_context != 0x0000u)
          {
            src_context = APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                                pASE,
                                                                pASE->streaming_audio_context);
          }
        }
        /* if context are now available, update them */
        available_snk_context = GMAPAPP_Context.AvailableSnkAudioContext | snk_context;
        available_src_context = GMAPAPP_Context.AvailableSrcAudioContext | src_context;

        /* now it's time to update the available audio contexts according to the new streaming audio context
         * of the specified ASE
         */
        pASE->streaming_audio_context = audio_context;

