STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
        /* Set audio contexts to removed from availability according to the streaming audio contexts associated to the
         * ASE.
         */
        if (pASE->type == ASE_SINK)
        {
          /* Remove the contexts which are not available according to Streaming Audio contexts of the ASE */
          available_snk_context = APP_UnavailableAudioContexts(pASE->type,available_snk_context,audio_context);
        }
        else /*(p_info->type & ASE_SOURCE)*/
        {
          /* Remove the contexts which are not available according to Streaming Audio contexts of the ASE */
          available_src_context = APP_UnavailableAudioContexts(ASE_SOURCE,available_src_context,audio_context);
        }
        LOG_INFO_APP("Previous Available Contexts are : Snk 0x%04X  - Src  0x%04X\n",
                     GMAPAPP_Context.AvailableSnkAudioContext,
                     GMAPAPP_Context.AvailableSrcAudioContext);
        LOG_INFO_APP("Calculated New Available Contexts are : Snk 0x%04X  - Src  0x%04X\n",
                     available_snk_context,
                     available_src_context);

        /*Set new available audio contexts for BAP Annoucement*/
        status = CAP_SetAvailableAudioContexts(available_snk_context,available_src_context);
        if (status == BLE_STATUS_SUCCESS)
        {
          if (pASE->type == ASE_SINK)
          {
            GMAPAPP_Context.AvailableSnkAudioContext = available_snk_context;
          }
          else /*(p_info->type & ASE_SOURCE)*/
          {
            GMAPAPP_Context.AvailableSrcAudioContext = available_src_context;
          }
          LOG_INFO_APP("Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                       GMAPAPP_Context.AvailableSnkAudioContext,
                       GMAPAPP_Context.AvailableSrcAudioContext);
        }
        else
        {
          LOG_INFO_APP("FAILURE to Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                       available_snk_context,
                       available_src_context);
        }

        if (GMAPAPP_Context.NumConn > 1u )
        {
          if ((p_conn->AvailableSnkAudioContext != SUPPORTED_SNK_CONTEXTS) \
              || (p_conn->AvailableSrcAudioContext != SUPPORTED_SRC_CONTEXTS))
          {
            /*update the available Audio Contexts of the CAP Initiator requesting the enable operation*/
            status = CAP_UpdateAvailableAudioContexts(ConnHandle,
                                                      SUPPORTED_SNK_CONTEXTS,
                                                      SUPPORTED_SRC_CONTEXTS);
            LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                         SUPPORTED_SNK_CONTEXTS,
                         SUPPORTED_SRC_CONTEXTS,
                         ConnHandle,
                         status);
            p_conn->AvailableSnkAudioContext = SUPPORTED_SNK_CONTEXTS;
            p_conn->AvailableSrcAudioContext = SUPPORTED_SRC_CONTEXTS;
          }
          else
          {
            LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                         SUPPORTED_SNK_CONTEXTS,
                         SUPPORTED_SRC_CONTEXTS,
                         ConnHandle);
          }

          for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
          {
            if ((GMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) && (&GMAPAPP_Context.ACL_Conn[conn] != p_conn))
            {
              if ((GMAPAPP_Context.ACL_Conn[conn].AvailableSnkAudioContext != GMAPAPP_Context.AvailableSnkAudioContext) \
                  || (GMAPAPP_Context.ACL_Conn[conn].AvailableSrcAudioContext != GMAPAPP_Context.AvailableSrcAudioContext))
              {
                /* we update the Audio Contexts availablity to other connected CAP Initiators */
                status = CAP_UpdateAvailableAudioContexts(GMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                                                          GMAPAPP_Context.AvailableSnkAudioContext,
                                                          GMAPAPP_Context.AvailableSrcAudioContext);
                LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                             GMAPAPP_Context.AvailableSnkAudioContext,
                             GMAPAPP_Context.AvailableSrcAudioContext,
                             GMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                             status);
                GMAPAPP_Context.ACL_Conn[conn].AvailableSnkAudioContext = GMAPAPP_Context.AvailableSnkAudioContext;
                GMAPAPP_Context.ACL_Conn[conn].AvailableSrcAudioContext = GMAPAPP_Context.AvailableSrcAudioContext;
              }
              else
              {
                LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                             GMAPAPP_Context.AvailableSnkAudioContext,
                             GMAPAPP_Context.AvailableSrcAudioContext,
                             GMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle);
              }
            }
          }
        }
        if (GMAPAPP_Context.NumConn < CFG_BLE_NUM_LINK )
        {
          GMAPAPP_StopAdvertising();
          /* Start Advertising */
          if (GMAPAPP_Context.CSIPRank > 0)
          {
            status = GMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, 0, GAP_APPEARANCE_EARBUD);
          }
          else
          {
            status = GMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, 0, GAP_APPEARANCE_HEADPHONES);
          }
          LOG_INFO_APP("GMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
        }
      }

