STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
  return available_context;
}

static APP_ACL_Conn_t *APP_GetACLConn(uint16_t ConnHandle)
{
  for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
  {
    if ( GMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle == ConnHandle)
    {
      return &GMAPAPP_Context.ACL_Conn[i];
    }
  }
  return 0;
}

static APP_ACL_Conn_t *APP_AllocateConn(uint16_t ConnHandle)
{
  /* Allocate new slot */
  for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
  {
    if ( GMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle == 0xFFFFu)
    {
      GMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle = ConnHandle;
      GMAPAPP_Context.ACL_Conn[i].AudioProfile = AUDIO_PROFILE_NONE;
      GMAPAPP_Context.ACL_Conn[i].ConfirmIndicationRequired = 0u;
      return &GMAPAPP_Context.ACL_Conn[i];
    }
  }
  return 0;
}

static APP_ASE_Info_t *APP_GetASE(uint8_t ASE_ID,uint16_t ACL_ConnHandle)
{
  uint8_t i;
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(ACL_ConnHandle);
  if (p_conn != 0)
  {
    if (p_conn->pASEs != 0)
    {
#if (APP_NUM_SNK_ASE > 0)
      if (GMAPAPP_Context.NumSnkASEs > 0u)
      {
        for ( i = 0; i < GMAPAPP_Context.NumSnkASEs;i++)
        {
          if ((p_conn->pASEs->aSnkASE[i].ID == ASE_ID) && (p_conn->pASEs->aSnkASE[i].allocated == 1u))
          {
            return &p_conn->pASEs->aSnkASE[i];
          }
        }
      }
#endif /*(APP_NUM_SNK_ASE > 0)*/
#if (APP_NUM_SRC_ASE > 0)
      if (GMAPAPP_Context.NumSrcASEs > 0u)
      {
        for ( i = 0; i < GMAPAPP_Context.NumSrcASEs;i++)
        {
          if ((p_conn->pASEs->aSrcASE[i].ID == ASE_ID) && (p_conn->pASEs->aSrcASE[i].allocated == 1u))
          {
            return &p_conn->pASEs->aSrcASE[i];
          }
        }
      }
#endif /*(APP_NUM_SRC_ASE > 0)*/
    }
  }
  return 0;
}

static uint8_t APP_UnicastSetupAudioDataPath(uint16_t ACL_ConnHandle,
                                             uint16_t CIS_ConnHandle,
                                             uint8_t ASE_ID,
                                             uint32_t ControllerDelay)
{
  tBleStatus status;
  Audio_Role_t role;
  Sampling_Freq_t frequency;
  Frame_Duration_t frame_duration;
  Audio_Chnl_Allocation_t audio_chnls;
  uint8_t num_chnls = 0;
  uint8_t i = 0;

  APP_ACL_Conn_t *p_conn;
  BAP_ASE_Info_t * p_ase;

  p_ase = CAP_Unicast_GetASEInfo(ACL_ConnHandle,ASE_ID);
  p_conn = APP_GetACLConn(ACL_ConnHandle);
  if(p_ase != 0 && p_conn != 0)
  {
    frequency = LTV_GetConfiguredSamplingFrequency(p_ase->params.Codec.CodecConf.pSpecificConf,
                                                   p_ase->params.Codec.CodecConf.SpecificConfLength);
    frame_duration = LTV_GetConfiguredFrameDuration(p_ase->params.Codec.CodecConf.pSpecificConf,
                                                    p_ase->params.Codec.CodecConf.SpecificConfLength);
    if ((frame_duration != FRAME_DURATION_7_5_MS) && (frame_duration != FRAME_DURATION_10_MS))
    {
      return BLE_STATUS_INVALID_PARAMS;
    }

   if (((p_ase->Type == ASE_SOURCE) && (GMAPAPP_Context.bap_role & BAP_ROLE_UNICAST_SERVER)) || \
      ((p_ase->Type == ASE_SINK) && (GMAPAPP_Context.bap_role & BAP_ROLE_UNICAST_CLIENT)))
    {
      /*Audio Data packets are sent to the remote device*/
      role = AUDIO_ROLE_SOURCE;
      LOG_INFO_APP("Setup Audio Peripheral for Source Role at Sampling frequency %d\n",frequency);
      GMAPAPP_Context.ConfiguredSourceSampleFrequency = frequency;
    }
    else if(((p_ase->Type == ASE_SINK) && (GMAPAPP_Context.bap_role & BAP_ROLE_UNICAST_SERVER)) || \
          ((p_ase->Type == ASE_SOURCE) && (GMAPAPP_Context.bap_role & BAP_ROLE_UNICAST_CLIENT)))
    {
      /* Audio Data packets are received from the remote device.*/
      role = AUDIO_ROLE_SINK;
      LOG_INFO_APP("Setup Audio Peripheral for Sink Role at Sampling frequency %d\n",frequency);
      GMAPAPP_Context.ConfiguredSinkSampleFrequency = frequency;
    }
    else
    {
      return BLE_STATUS_INVALID_PARAMS;
    }
    audio_chnls = LTV_GetConfiguredAudioChannelAllocation(p_ase->params.Codec.CodecConf.pSpecificConf,
                                                          p_ase->params.Codec.CodecConf.SpecificConfLength);

    if(audio_chnls != 0x00000000)
    {
      LOG_INFO_APP("Audio Channels Allocation Configuration : 0x%08X\n",audio_chnls);
      num_chnls = APP_GetBitsAudioChnlAllocations(audio_chnls);
      LOG_INFO_APP("Number of Audio Channels %d \n",num_chnls);
    }
    if (GMAPAPP_Context.audio_role_setup == 0x00)
    {
      Sampling_Freq_t target_frequency = frequency;
      APP_ASE_Info_t *p_app_ase2;
      BAP_ASE_Info_t *p_ase2;
      GMAPAPP_Context.SinkDecimation = 1;
      GMAPAPP_Context.SourceDecimation = 1;
      /* Check if other ASEs are configured with different sample rates */
      for (i = 0; i < APP_NUM_SNK_ASE + APP_NUM_SRC_ASE; i++)
      {
        if (i < APP_NUM_SNK_ASE)
        {
          p_app_ase2 = &p_conn->pASEs->aSnkASE[i];
        }
        else
        {
          p_app_ase2 = &p_conn->pASEs->aSrcASE[i-APP_NUM_SNK_ASE];
        }

        if (p_app_ase2->ID != p_ase->ASE_ID
            && p_app_ase2->type != p_ase->Type
            && p_app_ase2->allocated == 1u)
        {
          /* Found another ASE allocated */
          p_ase2 = CAP_Unicast_GetASEInfo(ACL_ConnHandle, p_conn->pASEs->aSnkASE[i].ID);
          if (p_ase2->State == ASE_STATE_ENABLING)
          {
            Sampling_Freq_t frequency2 = LTV_GetConfiguredSamplingFrequency(p_ase2->params.Codec.CodecConf.pSpecificConf,
                                                                            p_ase2->params.Codec.CodecConf.SpecificConfLength);
            if (target_frequency <= SAMPLE_FREQ_48000_HZ && frequency2 <= SAMPLE_FREQ_48000_HZ)
            {
              LOG_INFO_APP("Target Frequency = %d, Frequency2 = %d\n", target_frequency, frequency2);
              /* Retrieve frequency and decimation of combined frequencies */
              if (role == AUDIO_ROLE_SINK)
              {
                GMAPAPP_Context.SinkDecimation = APP_CombinedFrequencyTable[target_frequency][frequency2].Multiplier1;
                GMAPAPP_Context.SourceDecimation = APP_CombinedFrequencyTable[target_frequency][frequency2].Multiplier2;
              }
              else
              {
                GMAPAPP_Context.SourceDecimation = APP_CombinedFrequencyTable[target_frequency][frequency2].Multiplier1;
                GMAPAPP_Context.SinkDecimation = APP_CombinedFrequencyTable[target_frequency][frequency2].Multiplier2;
              }
              target_frequency = APP_CombinedFrequencyTable[target_frequency][frequency2].Frequency;
              LOG_INFO_APP("ASE id %d type %d and ASE id %d type %d are starting, using combined frequency %d\n",
                           p_ase->ASE_ID, p_ase->Type, p_app_ase2->ID, p_app_ase2->type, target_frequency);
              LOG_INFO_APP("Source Decimation Multipler = %d, Sink Decimation Multiplier = %d\n", GMAPAPP_Context.SourceDecimation, GMAPAPP_Context.SinkDecimation);
              break;
            }
          }
        }
      }

      LOG_INFO_APP("Configure Audio Periphal drivers at Sampling frequency %d\n", target_frequency);
      MX_AudioInit(role,target_frequency,
                   frame_duration,
                   (uint8_t *)aSnkBuff,
                   (uint8_t *)aSrcBuff);
    }
    if (role == AUDIO_ROLE_SOURCE)
    {
      for (i = 0; i< APP_MAX_NUM_CIS; i++)
      {
        if (GMAPAPP_Context.cis_src_handle[i] == 0xFFFFu)
        {
          GMAPAPP_Context.cis_src_handle[i] = CIS_ConnHandle;
          GMAPAPP_Context.num_cis_src++;
          break;
        }
      }
      if ((GMAPAPP_Context.audio_role_setup & role) == 0x00)
      {
        LOG_INFO_APP("Register callback to Start Audio Peripheral Rx\n");
        CODEC_RegisterTriggerClbk(1,0,&start_audio_source);
      }
    }
    else if (role == AUDIO_ROLE_SINK)
    {

      for (i = 0; i< APP_MAX_NUM_CIS; i++)
      {
        if (GMAPAPP_Context.cis_snk_handle[i] == 0xFFFFu)
        {
          GMAPAPP_Context.cis_snk_handle[i] = CIS_ConnHandle;
          GMAPAPP_Context.num_cis_snk++;
          break;
        }
      }
      if ((GMAPAPP_Context.audio_role_setup & role) == 0x00)
      {
        LOG_INFO_APP("Register callback to Start Audio Peripheral Tx\n");
        CODEC_RegisterTriggerClbk(1,1,&start_audio_sink);
      }
    }
    CODEC_DataPathParam_t param;
    /* input data path */
    param.SampleDepth = 16;

