STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.c
    /* SAI/I2C peripheral driver requests to set decimation to 2*/

    if (role == AUDIO_ROLE_SOURCE)
    {
      param.Decimation = GMAPAPP_Context.SourceDecimation; /* 1 * sample rate multiplier */
    }
    else
    {
      param.Decimation = GMAPAPP_Context.SinkDecimation * 2; /* 2 * sample rate multiplier */
    }

    /*Data Path ID is vendor-specific transport interface : 0x01 for "Shared memory of SAI"*/
    status = CAP_Unicast_SetupAudioDataPath(CIS_ConnHandle,
                                            ASE_ID,
                                            DATA_PATH_CIRCULAR_BUF,
                                            ControllerDelay,
                                            CONFIGURE_DATA_PATH_CONFIG_LEN,
                                            (uint8_t *)&param);
    LOG_INFO_APP("Setup Unicast Audio Data Path for ASE ID %d on CIS connection handle 0x%04X with controller delay at %d us returns status 0x%02X\n",
                ASE_ID,
                CIS_ConnHandle,
                ControllerDelay,
                status);
    if(status != BLE_STATUS_SUCCESS)
    {
      /*remove cis_handle*/
      if (role == AUDIO_ROLE_SOURCE)
      {
        for (i = 0; i< APP_MAX_NUM_CIS; i++)
        {
          if (GMAPAPP_Context.cis_src_handle[i] == CIS_ConnHandle)
          {
            GMAPAPP_Context.cis_src_handle[i] = 0xFFFFu;
            GMAPAPP_Context.num_cis_src--;
            break;
          }
        }
      }
      else if (role == AUDIO_ROLE_SINK)
      {
        for (i = 0; i< APP_MAX_NUM_CIS; i++)
        {
          if (GMAPAPP_Context.cis_snk_handle[i] == CIS_ConnHandle)
          {
            GMAPAPP_Context.cis_snk_handle[i] = 0xFFFFu;
            GMAPAPP_Context.num_cis_snk--;
            break;
          }
        }
      }
    }
    else
    {
      APP_ASE_Info_t *p_app_ase;
      p_app_ase = APP_GetASE(ASE_ID,ACL_ConnHandle);
      if (p_app_ase != 0)
      {
        LOG_INFO_APP("Audio Data Path is complete with remaining Application delay for audio process to respect : %dus\n",
                    (p_app_ase->presentation_delay - p_app_ase->controller_delay));
      }
    }
  }
  else
  {
    LOG_INFO_APP("No Audio Stream Endpoint with ASE ID %d on ACL connection handle 0x%04X status 0x%02X\n",
                ASE_ID,
                ACL_ConnHandle);
    status = BLE_STATUS_INVALID_PARAMS;
  }
  UNUSED(num_chnls);
  return status;
}

static uint8_t APP_GetBitsAudioChnlAllocations(Audio_Chnl_Allocation_t ChnlLocations)
{

  uint8_t bits = 0u;
  uint8_t i;

  for (i = 0; i < (8u*sizeof(Audio_Chnl_Allocation_t)); i++)
  {
    if (ChnlLocations & (1u<<i))
    {
      bits++;
    }
  }
  return bits;
}


/*Audio Source */
static int32_t start_audio_source(void)
{
  int32_t status;
  LOG_INFO_APP("START AUDIO SOURCE (input)\n");
  status = Start_RxAudio();

#if (CFG_LCD_SUPPORTED == 1)

  if ((GMAPAPP_Context.num_cis_established > 0u) && (GMAPAPP_Context.audio_role_setup != 0x00))
  {
    char sink_samplerate_text[8];
    char source_samplerate_text[8];

    switch (GMAPAPP_Context.ConfiguredSinkSampleFrequency)
    {
      case SAMPLE_FREQ_8000_HZ:
        snprintf(&sink_samplerate_text[0], 8, "8KHz");
        break;
      case SAMPLE_FREQ_16000_HZ:
        snprintf(&sink_samplerate_text[0], 8, "16KHz");
        break;
      case SAMPLE_FREQ_24000_HZ:
        snprintf(&sink_samplerate_text[0], 8, "24KHz");
        break;
      case SAMPLE_FREQ_32000_HZ:
        snprintf(&sink_samplerate_text[0], 8, "32KHz");
        break;
      case SAMPLE_FREQ_44100_HZ:
        snprintf(&sink_samplerate_text[0], 8, "44.1KHz");
        break;
      case SAMPLE_FREQ_48000_HZ:
        snprintf(&sink_samplerate_text[0], 8, "48KHz");
        break;
      default:
        snprintf(&sink_samplerate_text[0], 8, "??KHz");
        break;
    }

    switch (GMAPAPP_Context.ConfiguredSourceSampleFrequency)
    {
      case SAMPLE_FREQ_8000_HZ:
        snprintf(&source_samplerate_text[0], 8, "8KHz");
        break;
      case SAMPLE_FREQ_16000_HZ:
        snprintf(&source_samplerate_text[0], 8, "16KHz");
        break;
      case SAMPLE_FREQ_24000_HZ:
        snprintf(&source_samplerate_text[0], 8, "24KHz");
        break;
      case SAMPLE_FREQ_32000_HZ:
        snprintf(&source_samplerate_text[0], 8, "32KHz");
        break;
      case SAMPLE_FREQ_44100_HZ:
        snprintf(&source_samplerate_text[0], 8, "44.1KHz");
        break;
      case SAMPLE_FREQ_48000_HZ:
        snprintf(&source_samplerate_text[0], 8, "48KHz");
        break;
      default:
        snprintf(&source_samplerate_text[0], 8, "??KHz");
        break;
    }

    Menu_SetStreamingPage(sink_samplerate_text, source_samplerate_text, GMAPAPP_Context.audio_role_setup);
  }
#endif /* (CFG_LCD_SUPPORTED == 1) */
  return status;
}


/*Audio Sink */
static int32_t start_audio_sink(void)
{
  int32_t status;
  /* reset numbers of active channels */
  Nb_Active_Ch = 0;

  LOG_INFO_APP("START AUDIO SINK (output)\n");
  status = Start_TxAudio();

#if (CFG_LCD_SUPPORTED == 1)

  if ((GMAPAPP_Context.num_cis_established > 0u) && (GMAPAPP_Context.audio_role_setup != 0x00))
  {
    char sink_samplerate_text[8];
    char source_samplerate_text[8];

    switch (GMAPAPP_Context.ConfiguredSinkSampleFrequency)
    {
      case SAMPLE_FREQ_8000_HZ:
        snprintf(&sink_samplerate_text[0], 8, "8KHz");
        break;
      case SAMPLE_FREQ_16000_HZ:
        snprintf(&sink_samplerate_text[0], 8, "16KHz");
        break;
      case SAMPLE_FREQ_24000_HZ:
        snprintf(&sink_samplerate_text[0], 8, "24KHz");
        break;
      case SAMPLE_FREQ_32000_HZ:
        snprintf(&sink_samplerate_text[0], 8, "32KHz");
        break;
      case SAMPLE_FREQ_44100_HZ:
        snprintf(&sink_samplerate_text[0], 8, "44.1KHz");
        break;
      case SAMPLE_FREQ_48000_HZ:
        snprintf(&sink_samplerate_text[0], 8, "48KHz");
        break;
      default:
        snprintf(&sink_samplerate_text[0], 8, "??KHz");
        break;
    }

    switch (GMAPAPP_Context.ConfiguredSourceSampleFrequency)
    {
      case SAMPLE_FREQ_8000_HZ:
        snprintf(&source_samplerate_text[0], 8, "8KHz");
        break;
      case SAMPLE_FREQ_16000_HZ:
        snprintf(&source_samplerate_text[0], 8, "16KHz");
        break;
      case SAMPLE_FREQ_24000_HZ:
        snprintf(&source_samplerate_text[0], 8, "24KHz");
        break;
      case SAMPLE_FREQ_32000_HZ:
        snprintf(&source_samplerate_text[0], 8, "32KHz");
        break;
      case SAMPLE_FREQ_44100_HZ:
        snprintf(&source_samplerate_text[0], 8, "44.1KHz");
        break;
      case SAMPLE_FREQ_48000_HZ:
        snprintf(&source_samplerate_text[0], 8, "48KHz");
        break;
      default:
        snprintf(&source_samplerate_text[0], 8, "??KHz");
        break;
    }

    Menu_SetStreamingPage(sink_samplerate_text, source_samplerate_text, GMAPAPP_Context.audio_role_setup);
  }
#endif /* (CFG_LCD_SUPPORTED == 1) */
  return status;
}

#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
static void VCP_MetaEvt_Notification(VCP_Notification_Evt_t *pNotification)
{
  switch(pNotification->EvtOpcode)
  {
    case VCP_RENDERER_UPDATED_VOLUME_STATE_EVT:
    {
      VCP_VolumeState_Evt_t *p_info = (VCP_VolumeState_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Updated Volume State :\n");
      LOG_INFO_APP("     Volume Setting : %d\n",p_info->VolSetting);
      LOG_INFO_APP("     Mute : %d\n",p_info->Mute);
      LOG_INFO_APP("     Change Counter : %d\n",p_info->ChangeCounter);
      Volume = p_info->VolSetting;
      Mute = p_info->Mute;
      if (Mute == 0)
      {
        Menu_SetVolume(p_info->VolSetting);
        Set_Volume(p_info->VolSetting);
      }
      else
      {
        Menu_SetVolume(0);
        Set_Volume(0);
      }
      break;
    }

    case VCP_RENDERER_UPDATED_AUDIO_INPUT_STATE_EVT:
    {
      VCP_AudioInputState_Evt_t *p_info = (VCP_AudioInputState_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Updated Audio Input State :\n");
      LOG_INFO_APP("     Instance ID : %d\n",p_info->AICInst);
      LOG_INFO_APP("     Gain Setting : %d\n",p_info->State.GainSetting);
      LOG_INFO_APP("     Mute : %d\n",p_info->State.Mute);
      LOG_INFO_APP("     Gain Mode : %d\n",p_info->State.GainMode);
      LOG_INFO_APP("     Change Counter : %d\n",p_info->ChangeCounter);
      UNUSED(p_info);
      break;
    }

    case VCP_RENDERER_UPDATED_AUDIO_INPUT_DESCRIPTION_EVT:
    {
      VCP_AudioDescription_Evt_t *p_info = (VCP_AudioDescription_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Updated Audio Input Description :\n");
      LOG_INFO_APP("     Instance ID : %d\n",p_info->Inst);
      LOG_INFO_APP("     Description : ");
      Print_String(p_info->pData, p_info->DataLength);
      LOG_INFO_APP("\n");
      break;
    }

    case VCP_RENDERER_UPDATED_VOLUME_OFFSET_STATE_EVT:
    {
      VCP_VolumeOffsetState_Evt_t *p_info = (VCP_VolumeOffsetState_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[VOC %d] Updated Volume Offset State :\n",p_info->VOCInst);
      LOG_INFO_APP("     Volume Offset: %d \n",p_info->VolumeOffset);
      LOG_INFO_APP("     Change Counter : %d\n",p_info->ChangeCounter);
      UNUSED(p_info);
      break;
    }

    case VCP_RENDERER_UPDATED_AUDIO_OUTPUT_LOCATION_EVT:
    {
      VCP_AudioLocation_Evt_t *p_info = (VCP_AudioLocation_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[VOC %d] Updated Audio Location : 0x%08X\n",p_info->VOCInst,p_info->AudioLocation);
      UNUSED(p_info);
      break;
    }

